[
    {
        "text": "Funny that you don't see the errors in your post considering that a whole lot of right wingers just voted in a president who against free trade.",
        "label": "yes"
    },
    {
        "text": "The irresponsible media has 'no interest in unifying America'.What would the left do without the class wars, gender wars, race wars that they love to keep the fools voting for 'progress' as the left see fit.",
        "label": "yes"
    },
    {
        "text": "Silvershelf aka Tom Smarty Pants - Talk about over-killing an opinion. Like most Liberal progressives, you like to dish it out but you can't take it. Cheers.",
        "label": "yes"
    },
    {
        "text": "'Saturn, if you truly believe that, you don't understand the issues in the broader context.'Or the rest of the story, in that the university is the one that stirred it up with its incompetent response.",
        "label": "yes"
    },
    {
        "text": "Oh me oh my THE SKY IS FALLING THE SKY IS FALLING! Watch out for Andrew Scheer! btw how can he ruin our country since Turdeau already has.",
        "label": "yes"
    },
    {
        "text": "Very first sentence: 'A few days ago I was on the Golan Heights, gazing across into Syria.'=======No, airhead, if you were on the Golan Heights, you were already in Syria.",
        "label": "yes"
    },
    {
        "text": "I think a referendum on the matter is in order..... (after which we throw the warmongers with their jingoism and brinkmanship out -maybe stick them on a deserted island somewhere to duke it out)",
        "label": "yes"
    },
    {
        "text": "The puppet master is at it again. Usually we see his hand up Rob's shirt moving his mouth, now he's running his own. These guys are like Abbott and Costello only dumber.",
        "label": "yes"
    },
    {
        "text": "@Jan60 & @Quaxo The point sirs is not all food is equal. Not all food is health food Some is poison. When we exercise we burn calories - simple. When we eat we ingest calories - simple right? WRONG!!! You both missed the point.",
        "label": "yes"
    },
    {
        "text": "Thank you for this editorial. I really enjoyed the tone and content of your writing. Can you publish this in Alberta? I hope you have hidden yourself in a safe and secure location. Hell hath no fury than this prime minister scorned.",
        "label": "yes"
    },
    {
        "text": "who are talibanesque bigots? supporters of the Taliban come from the LEFT eg. Jack Layton's lovely nickname was TALIBAN JACK Just call the left \"talibanesque\" bigot is redundant it is obvious",
        "label": "yes"
    },
    {
        "text": "Kathleen is whistling past the graveyard she and the Liberals built. Glad to hear she's so proud of it. Some people are stupid, some are greedy. The dangerous one's like Dear Kathleen are both.",
        "label": "yes"
    },
    {
        "text": "Brilliant Freefroggy. Just brilliant. Don't address the issues, never mind the facts, just sneer at Liberals, as though you have a clue about anything. You obviously don't.",
        "label": "yes"
    },
    {
        "text": "All left wing parrots, at least have the integrity to admit it - yes how many of these new ' accomplished ' people ever voted conservative, ZERO!!! Harpers biggest mistake was not filling up the senate before he left.",
        "label": "yes"
    },
    {
        "text": "Then your imagination is lacking . imagine them within living memory of many. ?1936 to 1945 or longer in some cases yes Ww II ONLY COST ABOUT 25 million lives, plus millions more ruined",
        "label": "yes"
    },
    {
        "text": "@AntiFascist: Here he is again! It's a rhetorical question but do ever post anything here that has even the slightest relevance to the subject and isn't an anti-Israel rant? Apparently not! Kind of predictable and boring - even for a troll.",
        "label": "yes"
    },
    {
        "text": "Just for asking \"canfan\" for a valid reference to the work s/he is citing, I get two thumbs down votes. Apparently some here think of themselves as mushroom farmers LOL...",
        "label": "yes"
    },
    {
        "text": "Mister is my name.--And another thing: get off my lawn you damn kids! And turn down that blasted music! And pull up your pants! And you know, back my MY day...",
        "label": "yes"
    },
    {
        "text": "What makes you an expert on using natural gas fired turbines for electrical generation? Have you ever designed or built one? Or are you just being your typical blowhard?",
        "label": "yes"
    },
    {
        "text": "This reminds me of 1980-1982 when when we had a Prime Minister Trudeau and mortgage rates hit 22% and the highest number of mortgage foreclosures in Canadian history. And it reads like a high school essay from a 15 year old student.",
        "label": "yes"
    },
    {
        "text": "The only reason we do not see more Harperites posting their destructive acid today is that the PMO is on Christmas break so is not monitoring this site.",
        "label": "yes"
    },
    {
        "text": "No, you should never try to figure it out, it requires grade 10 reading comprehension and basic understanding of history and civics. Not possible for you, especially to do while playing video games and chatting on Facebag.",
        "label": "yes"
    },
    {
        "text": "I don't know if you're American or Canadian, but your use of an expression that refers to specific Washington, DC geography suggests your 'the rest of us' isn't particularly relevant to Canadians.",
        "label": "yes"
    },
    {
        "text": "Sure, and people who worked hard to pay off their mortgage should pay extra property tax... right. Donald Trump is looking for thinkers like you.",
        "label": "yes"
    },
    {
        "text": "Clinton prepares for debates like any normal person unlike Trump who just can't tear himself away from the ego trip of the adoration of the \"poorly educated\", ha, ha, ha.",
        "label": "yes"
    },
    {
        "text": "Yes, \"the west wants in\" was always a rubbish statement but it played well to the dumber members of Canadian society. Diefenbaker, Clark, Campbell, Turner ... etc.",
        "label": "yes"
    },
    {
        "text": "When will the Iroquois nation pay back the surviving Huron natives for the genocides of the 18th Century? That reparation and reconciliation should be worth a few billion by now in today's money.",
        "label": "yes"
    },
    {
        "text": "Justice4AllTo answer your question, YES. In fact, IMO, there are 2 western leaders that should have already seen the front end of a firing squad.",
        "label": "yes"
    },
    {
        "text": "Silly, it's not the Harper judges telling women in COngo they can't abort their unwanted rape pregnancies - Harper leaves that joy for his cabinet ministers!",
        "label": "yes"
    },
    {
        "text": "Don't undermine the argument against banning assault weapons by pointing out that terrorists sometimes use much cruder weaponry. Civilians need guns only to hunt or for target shooting. All other guns should be banned.",
        "label": "yes"
    },
    {
        "text": "Man, what weird logic. \"Lemming\" logic, actually (\"Oh look, they're all rushing off the cliff... must OK if they're all doing it. Lemme do it, too..\") Me? I'd head for the lifeboat davit.",
        "label": "yes"
    },
    {
        "text": "now, why would you say that, then? give me on specific example. or is yours just another tired and predictable wing-nut screed like yesterday's breakfast?",
        "label": "yes"
    },
    {
        "text": "No one I've spoken to has any idea what's in the bill, so how can it really be popular. What's popular is the 'down with terrorists!' nonsense.",
        "label": "yes"
    },
    {
        "text": "Where is death to Harper mentioned Lazy Beaver 1's chatter ? Death may only be in your ability to read and to reason. Not disgusting, just pathetic.",
        "label": "yes"
    },
    {
        "text": "Yes it is complete crap and has been debunked many many times//www.hc-sc.gc.ca/fn-an/gmf-agm/seralini-eng.phpI have many more refs to scientific opinions of it if you want more.",
        "label": "yes"
    },
    {
        "text": "Ontario is and has always been the largest net contributor to Ottawa. You guys should check your facts. Link Byfield lied. This stuff my go down well down the Legion in Red Deer, but it's actually balderdash.",
        "label": "yes"
    },
    {
        "text": "The kid had a knife. The cop wet his pants and shot him to death. For this, we pay Toronto cops 100k a year. Now THAT'S value for money.",
        "label": "yes"
    },
    {
        "text": "\"we should try to do everything possible to return her safely home.\" After two very long comments mostly scornful towards Huma Hoodfars, you get to the point. Good.",
        "label": "yes"
    },
    {
        "text": "The fact that the LCBO / Vintages 'needed' to advertise at the top of the globe for the entire holiday season is completely baffling to me. Is the advertising for its captive market or for the Globe's revenue stream?",
        "label": "yes"
    },
    {
        "text": "nice job, mr. mayor. your sweet deal to the police union has resulted in the same for the firefighters. next? the ttc which you declared 'essential' will get just as big a raise through arbitration. idiot.",
        "label": "yes"
    },
    {
        "text": "Fascists have always been aligned with the Arab world. Hitler was and the connection between the left and the Arab world continues to this day.",
        "label": "yes"
    },
    {
        "text": "It's not important how long you live but how you live. Those that die contented with their lives win. Those that think others should live their lives according to the script provided by others should mind their own damned business.",
        "label": "yes"
    },
    {
        "text": "Yeah I know, the government just rounded me up to my work camp today! they're making me give up all my belongings to a family of religious extremeist child rapests who immigrated from Mexistan... ohh wait nevermind, that didn't happen",
        "label": "yes"
    },
    {
        "text": "It was beautiful 20 years ago, the downtown is a sorry shell today. It's interesting to watch a city implode while everyone looks the other way.",
        "label": "yes"
    },
    {
        "text": "...she rolls out aseries of her so called attacks on faith....none of which attack Jesus, or Mohamed or Budda etc .... the pope's the church, aand her aunt....that's not attacking faith",
        "label": "yes"
    },
    {
        "text": "You are wildly off-base. The author has far more insight and intellect to contribute than you can even grasp. Don't revel in your ignorance.",
        "label": "yes"
    },
    {
        "text": "@showmecanuck Note: A cancer patient gets a thumbs down hereabouts - without explanation. Or is that just another \"alarmist Chicken Little\" contribution in your childish parlance.",
        "label": "yes"
    },
    {
        "text": "Yep, there is no middle ground with Wynne liberals, you are either for them or in the \"dark ages,\" because they can do no wrong. And if monkeys had wings they'd fly out my butt.",
        "label": "yes"
    },
    {
        "text": "Good Jadondre....then maybe it is time for the natives to start abiding by the treaties because they have been breaching them with impunity.",
        "label": "yes"
    },
    {
        "text": "The kids are busy dreaming up 'correct' responses to the daily inquisitions by their pathologically status conscious helicopter parents",
        "label": "yes"
    },
    {
        "text": "Yeah, right, the Feds are the epitome of good management. That's why Canada is such a train wreck nowadays. Ontario's a mess, Quebec's a mess, Alberta's a mess, BC is a mess.... yup, Tory Times are tough times.",
        "label": "yes"
    },
    {
        "text": "Yeh, Quebeckers are so ignorant they vote for the PQ, whereas, Canadians such as yourself are so smart they vote the Harper evangelical-reformists in government. You must be so proud !",
        "label": "yes"
    },
    {
        "text": "that way you emphasize your important points in ALL CAPS is really grabbing my attention and making me listen to your excellent observations, great job.",
        "label": "yes"
    },
    {
        "text": "You know what? I would have really appreciated it if the Globe and Mail would have told me Gordon Gibson is associated with, works for that venerable, wonderfully moderate extreme right wing think tank, the Fraser Institute. Zealots.",
        "label": "yes"
    },
    {
        "text": "Maybe you better keep a close eye on the nuclear subs sitting off the coast of Canada and the US. So who should take who out? Idiots who propose WW3 as you do should hopefully be the first in line to go. Maybe on the end of the A-8.",
        "label": "yes"
    },
    {
        "text": "I suppose you will be told that because male judges wear robes at work, they too refuse to adapt to Canadian values and thus their judgment cannot be trusted. 'Ennemies of the country' are everywhere. LOL",
        "label": "yes"
    },
    {
        "text": "hard core separatists who stay in Canada...?and what does 'arrogant to a distraction' actually mean? vraiment!!! You sound a little anti-francophone to me. Perhaps if Justin changed his last name to Waterhole you'd vote for him lol.",
        "label": "yes"
    },
    {
        "text": "Although pretty boy Justin is an airhead, Canada would be much better off with either the CPC or LPC in charge. The NDP are nothing but a bunch of whackjobs that have no idea as to how the real world works.",
        "label": "yes"
    },
    {
        "text": "NoinradClearly you are a 'believer', and no amount of adverse data will change your mind. You are the little kid with fingers in ears saying la la la can't hear you!",
        "label": "yes"
    },
    {
        "text": "Ah - no wonder when the white Christian man came they considered native canadians 'uncivilized' when their definition of civilzation was built on the wisdom of the Pope who considered individual conscience stupid.",
        "label": "yes"
    },
    {
        "text": "Wow, Moseby1 you seem hungup that I'm able to provide facts that counter the BS the antis spew. It's interesting that facts threaten you!! At least I use my real name and don't hide behind something that no one can identify!!",
        "label": "yes"
    },
    {
        "text": "It seems you understand very little about honesty, or marijuana, for that matter. On that score, you are in good company among ReformaCon puppets.",
        "label": "yes"
    },
    {
        "text": "How about forming a groupQueers Against Russian Apartheid of Gays - QuARAGbased onQuAIA - Queers Against Israeli Apartheid, that Toronto group",
        "label": "yes"
    },
    {
        "text": "'There is no honesty left in the Western mainstream media. Just brainwashing and globalist propaganda'Don't worry, you've still got the truth tellers at RT and Sputnik News.",
        "label": "yes"
    },
    {
        "text": "Is there a funding shortfall at Woodbridge as they cannot pay for decent writers who do fact based research? I would expect this out of the Toronto Star, but now the Globe and Mail should be called the Special Interest Anti-Male.",
        "label": "yes"
    },
    {
        "text": "'How a preening, bellicose racist was allowed to trump American values'Shouldn't this read...'How a preening, bellicose racist has continued to reflect the values or lack thereof, of many Americans?'",
        "label": "yes"
    },
    {
        "text": "So what? Those are reasons for voting for Trump? Because, \"It is possible that hostile actors ...\"? Trump is the noxious product of Fox News, and a racist, delusional Tea Party. Even the GOP finds he has no redeeming qualities whatsoever.",
        "label": "yes"
    },
    {
        "text": "Yup, no spin whatsoever from the \"pro choice\" side: 8 months of \"choice\" isn't enough, that \"fetus\" halfway out the birth canal is still just a lump of cells, just part of the woman's body, right?",
        "label": "yes"
    },
    {
        "text": "I hope you are also teaching your son (with equal time) about the problems with all religion, in general. Otherwise, you are just promoting hatred against muslims, and that puts you in no better a position than the muslim texts that you cite.",
        "label": "yes"
    },
    {
        "text": "not going to read the hate spiel from this lunatic but I bet there is some stuff about sexism as well... oh and the racism thing as well.",
        "label": "yes"
    },
    {
        "text": "The only echo chamber is the lamestream media that's constantly shoving globalist cockroaches like Trudeau and Clinton down our throats. That's why the lamesteam media is failing, nobody's buying their elitist lies anymore.",
        "label": "yes"
    },
    {
        "text": "The PMO has fumbled very badly on this issue (whether Steve was personally involved or not) and Senator Duffy should resign forthwith. Very disappointing performance.",
        "label": "yes"
    },
    {
        "text": "Nutcases like you will be heartily condemned, as you should be, by the same people who wouldn't dare say boo to the equivalent from that other religion.",
        "label": "yes"
    },
    {
        "text": "if you are damn, even RT will not change your opinion. So I do not see too much risk to us in here... but since you mentioned some cute Brits on it, I have to check it out.",
        "label": "yes"
    },
    {
        "text": "Sorry - Harper is too busy covering up robocalls to listen, Gary. Which gov't is more deceitful and corrupt: the BC Fiberals or the Harper Tories?",
        "label": "yes"
    },
    {
        "text": "And Mike Harris the devil himself made Ontario a better place , huh Mr Naive . Hudak is just another family member of the snake himself",
        "label": "yes"
    },
    {
        "text": "Are you aware of the many Christian sects who fully espouse the anti-women sections of the Bible? Do you think it is the PM's sworn duty to set these people straight?",
        "label": "yes"
    },
    {
        "text": "Sask. corruption hmmm & half of Devines cabinet thrown in jail... but yeah, Montreal & Toronto got big problems... glad I'm here in Vanc.",
        "label": "yes"
    },
    {
        "text": "Loser's defence. Why not a fire off a stinging rebuttal instead of hurling adolescent insults? Unless you have none and 'what else can you do?'",
        "label": "yes"
    },
    {
        "text": "Of course they have freedom of expresion, d2012. They doesn't explain their determined refusal to become even minimally informed first.",
        "label": "yes"
    },
    {
        "text": "Correction: The US will do what 'the governing party thinks' is in the best interests of the US, and will give little thought to Canada regardless of how obedient our government is to the whims of Presidents.",
        "label": "yes"
    },
    {
        "text": "Addiction Research says pot should be legalized. Trudeau was right. Harper and his bandits have been setting up shop behind the scenes....hypocrites.",
        "label": "yes"
    },
    {
        "text": "WOOOOOOOOOOOOOOOOOOOOW wow..... I......wow.....this...right here... Ok, you ever heard something so THICKHEADED that it put you in shock, LL7, what you wrote is it, for normal people.",
        "label": "yes"
    },
    {
        "text": "Jozef Conrad 23 hours agoOne would expect that an article relating to Sharon's legacy would be written by a non-Israeli (to avoid bias) ... -----maybe written by an ARAB - no biasor a naive leftists in the west - no biassarcasm",
        "label": "yes"
    },
    {
        "text": "Your childish and repetitive comments are most annoying. Tell me, is Ms. Gagnon your ex-wife? Or did her dog just defecate on your lawn?",
        "label": "yes"
    },
    {
        "text": "Yes, let's fabricate an argument on a premise that is never likely to happen. Mulcair and Trudeau cowards? Hey, they're not who is afraid of the Islamic bogeyman in the Middle East. Neither am I? Are you afraid of them?",
        "label": "yes"
    },
    {
        "text": "'the media and progressives (no one considers Khadr a hero)'Boy, SOMEONE sure hasn't been paying attention to much of anything lately...",
        "label": "yes"
    },
    {
        "text": "The words 'complexity' and 'Trudeau' should never appear together in the same sentence. The first is a poor descriptor, while the latter wouldn't really know what such a big word means. Hell, he probably can't even spell it.",
        "label": "yes"
    },
    {
        "text": "lefty I know dozens of professionals who consume Cannabis and are very successful. How is you life in the trailer park( where very few consume Cannabis but do smoke cigarettes and beer.)",
        "label": "yes"
    },
    {
        "text": "It is hard to blame Horwath. Who could have ever imagined that the public would return the worst and most corrupt government in Ontario's history to a Majority.",
        "label": "yes"
    },
    {
        "text": "C_Williams Actually conventions are part of the constitution . The constitution is made up of the written part and conventions . Who doesn't know that . I guess you .",
        "label": "yes"
    },
    {
        "text": "I never get tired of pointing out to the world what a classless troll z55man is. This paid troll is the quintessential vanguard of the Trump movement.",
        "label": "yes"
    },
    {
        "text": "... or a corrupt establishment politicians feathering her nest... and a naive billionaire who thinks he can beat the system .... so pa thetic ...",
        "label": "yes"
    },
    {
        "text": "All CONs are either on the take or interested in promoting their fetid views (moronic fundamentalist, bigoted/racist, anti working people and rural welfare).",
        "label": "yes"
    },
    {
        "text": "Congratulations Emilio: you are a fool, easily tricked by a demagogue who has no idea what he's doing. PS, Trump's fraud trial begins this month, and he's got even nastier trials on the horizon. You've been duped.",
        "label": "yes"
    },
    {
        "text": "Intervention caused the entire mess but... uhhhhh...intervention is still good.---------intervention did not cause the messit is Assad and ISIS-",
        "label": "yes"
    },
    {
        "text": "Hear, hear. The armchair spies are out in full force today. Doesn't matter what you think. This man has done more of significance for his country than either of you losers ever will.",
        "label": "yes"
    },
    {
        "text": "What's that other noise? Sounds like someone ranting about something that a) isn't an issue and b) isn't even remotely related to the article to which they are commenting. Move on, please.",
        "label": "yes"
    },
    {
        "text": "The line that 'Canada will be more effective' by not fighting ranks up there with pretending that the refugee effort is anything more than Canadian reputation rehabilitation and grandstanding.",
        "label": "yes"
    },
    {
        "text": "'''One of the things I'd expect a Liberal government to do is to cut immigration in half.'''The odds against that happening must be in the multiple quadrillions. Do you think it possible?",
        "label": "yes"
    },
    {
        "text": "Wow, you really had to perform some mental acrobatics to draw Harper into this discussion! I think you are possibly, a little obsessed with the man.",
        "label": "yes"
    },
    {
        "text": "And he droned on and on while in full ignorance of the vacuity of his message. Meanwhile , in unrelated news, water flows downhill everywhere but the moon..",
        "label": "yes"
    },
    {
        "text": "Actually I have, those who believe in fairy tales and other assorted biblical / religious stories are the ones drinking milk and eating cookies. Ba, Baaaa",
        "label": "yes"
    },
    {
        "text": "The Americans get it. The EU gets it. Canada? Not so much. Nobody cares what's happening to our research and higher education except the people who work in it. It's really a sad state of affairs. Ignorance is bliss, I guess.",
        "label": "yes"
    },
    {
        "text": "I'm not sure whether you are one of the affected civil servants who understandably are not happy with this announcement or not. I do know that you have written one of the most annoying posts ever to appear on this sight. Get a life!",
        "label": "yes"
    },
    {
        "text": "OK..so if I wear a tshirt with a peace symbol? Or an anarchist symbol. Or...let's just say , a hammer and sickle? I'm asking where you draw the line although I know your answer. Headscarves.",
        "label": "yes"
    },
    {
        "text": "reserves and race based resource entitlements ARE an apartheid system... Agreed!! The natives are the racists and we are the (intended) victims.",
        "label": "yes"
    },
    {
        "text": "'Police officers need to hold themselves and their co workers to high standards.'they're human, they don't.They need to be held accountable by us and our elected m0r0ns",
        "label": "yes"
    },
    {
        "text": "Actually, they rent it for 6 months. Then parliament addresses whether or not to stay involved, and the new decision gets new ownership.",
        "label": "yes"
    },
    {
        "text": "These modern day 'Feminists' seem to have penis envy more than anything else. You just need to look at their argument and what they lament they wish they had.",
        "label": "yes"
    },
    {
        "text": "Perhaps you have been in the Egyptian desert. The questions being asked are the questions that thinking people HAVE been wondering about . The fact that you feel insulted by the audacity of the G & M asking, says you have decided not to think.",
        "label": "yes"
    },
    {
        "text": "Typical of Ms Wente....just pick the data that supports her point and don't bother doing any more research or analytical work than she has to.",
        "label": "yes"
    },
    {
        "text": "I don't know what video you were watching but your comment is ignorant and ridiculous. What are you related to this cop? You are a fool is you think this is acceptable behaviour in any society, especially from a police officer.",
        "label": "yes"
    },
    {
        "text": "journalist, good one! This guy should stick to his rottentomatoes. com reviews. Did a real journalist call in sick today, and they had to call this guy up?(I think Mike Myers must have snubbed him at a TIFF event or something)",
        "label": "yes"
    },
    {
        "text": "The Republicans are owned by the NRA. Mass killings will never stop until the Republican Party grows a spine. They have the blood of tens of thousands of innocent Americans on their hands.",
        "label": "yes"
    },
    {
        "text": "Hahaha! You're right. They cracked down on dogs in our local Vancouver park and now it's dead, hardly anyone appreciates the park any more.",
        "label": "yes"
    },
    {
        "text": "The problem is voters were to stupid to realize that 3 is impossible if you live up to 1 and 2. So its an accepted premise that she will break her promises. And the jokes on the dumb electorate.",
        "label": "yes"
    },
    {
        "text": "You're right. We should go full Orwellian. Great idea. Let's start with 24 hours cameras on YOU. Let's see what we can get you on. I think, at least speeding. And you probably swear once in a while too.",
        "label": "yes"
    },
    {
        "text": "Now which political leader was it who trekked down to London to trumpet his government's gift of cash to CAT to keep Electromotive running?",
        "label": "yes"
    },
    {
        "text": "Iran is a cesspool, even the americans and canadians that went there came back as sadists. let it rot. let Isreal rot too. leave Canada out of that BS.",
        "label": "yes"
    },
    {
        "text": "Your posting is classic assumption and a better understanding of a dictionary than the English language. You contradict the thing you wish to defend.",
        "label": "yes"
    },
    {
        "text": "NETNUB, what makes communists or Mao part of the left? Are you suggesting that progressives are more intolerant than conservatives? Because otherwise you're just being intellectually boring.",
        "label": "yes"
    },
    {
        "text": "MSymons, Don't be too disheartened. The ones who post such drivel are simple self-righteous ignoramouses with nothing better to do than advertise their stupidity. Many more Canadians would appreciate an honest dialogue but you won't find it here.",
        "label": "yes"
    },
    {
        "text": "Nervous laughter - the liberals know he is MAD - they will soon worry about their jobs. Trudeau Jung Un continues to show his true self - just look into his eyes.",
        "label": "yes"
    },
    {
        "text": "It must be terrible for Aziz to live in a hellhole like England. Why doesn't she move to the paradise that is Pakistan ? Unfortunately, she couldn't write whining articles about Islamophobia for bien pensant editors at the G&M if she did.",
        "label": "yes"
    },
    {
        "text": "Oh, you smug Canadians....Just wait until YOU get attacked....think it won't happen? Guess again. Then we'll see how 'tolerant' you are.",
        "label": "yes"
    },
    {
        "text": "Lets see now. If they go or attempt to go to join ISIS they are a terrorist. If they decide to act while in Canada they are a criminal or they are mentally ill. Funny how that works.",
        "label": "yes"
    },
    {
        "text": "Ideology and religions is what you should be referring too. Right wing has never been politically correct. But then again you have proven you're just as nutty as this article. Leah, is that you?",
        "label": "yes"
    },
    {
        "text": "I have to be careful not to disparage a practice that allows a man to divorce by uttering some word 3 times? Even by phone or text? What are you smoking?",
        "label": "yes"
    },
    {
        "text": "Right, poor handling of the economy. Record job creation. All the Bushes and Reagans in the world couldn't even begin to touch him on job creation. And that was after being handed a mess by Bush.",
        "label": "yes"
    },
    {
        "text": "If you are anti-murder, how can you possibly support the Palestinians? I don't get it - someone gets a pass as long as they are only killing women and children? Come on!",
        "label": "yes"
    },
    {
        "text": "What an ill-informed comment. On what do you base your assumption that the student is a Muslim? It is much more likely that he is an Orthodox Jew and such separations are permitted in Israel.",
        "label": "yes"
    },
    {
        "text": "'Judges frequently make wrong decisions.'----------But you want those 'wrong judges' to still impose a mandatory sentence? They're so incompetent to start with, they need help to get it more wrong?.",
        "label": "yes"
    },
    {
        "text": "YOU NEVER USE GOOGLE EARTH? DON'T USE GOOGLE. I GET ADS FOR TRIPS TO CUBA ALL THE TIME. AND OLD AGE HOMES. SO WHAT? YOU WANT THE INTERNET TO COST NOTHING? THERE MUST BE ADS.",
        "label": "yes"
    },
    {
        "text": "Yes, I believe that Canada took the same approach when Europe got themselves embroiled in a war over there. It is always a good argument to say that if it's not in my backyard, it's not my problem, right?",
        "label": "yes"
    },
    {
        "text": "Go polish your guns John and feel like a man considering the brain never developed as it should....maybe there is a UFC or football game on.....the greater edifying american past-times...lol",
        "label": "yes"
    },
    {
        "text": "Overheard at the Globe and Mail: '... Jeff, pay attention. It goes on to say they want to see, specifically, the word 'gaffe', got it? Okay, remember the whole point is to try to paint gold with sh!t. Buck up, it'll be like old times.'",
        "label": "yes"
    },
    {
        "text": "So the daughter should be judged by the sins of the father? Hmmm.How far do you want to carry that principle? England, in years gone by, plundered the world, therefore, any thought from an English brain has No credibility.",
        "label": "yes"
    },
    {
        "text": "no ???...an other one ???...how many of you in ROC with such disease ???...is there any ANTIDOTE in the ROC against disease such as 'R.C.S.S.' (Radio-Canada Separatits Syndrome) ???",
        "label": "yes"
    },
    {
        "text": "We shall indeed see how he governs, with Bannon of Breitbart putting ideas in his ear and the low-down and self-avowedly white supremacist Spencer nearby, but elsewhere.",
        "label": "yes"
    },
    {
        "text": "What an utterly ridiculous comment, you socialists need to read a book once in a while. Get a grip on reality DSB111. That's pretty sad if that's what you actually believe.",
        "label": "yes"
    },
    {
        "text": "I don't get the sense that PKP has the Burlesque-oni bunga-bunga factor going for him, which is probably just as well, especially for underage strippers.",
        "label": "yes"
    },
    {
        "text": "Everything the Liberals do are based on their motto of 'do as I say not as I do' and they never lie since all promises made are 'stretch goals'.",
        "label": "yes"
    },
    {
        "text": "Do you realise your attitude is the definition of racism? The more we learn about people rooted in the 3rd world, the more we learn why it's the 3rd world.",
        "label": "yes"
    },
    {
        "text": "And Kathleen Wynne kicks the Ontario taxpayer in the teeth day after day with her wasted BILLIONS. Sorry, I forgot, wasted billions is okay with the sheeple crowd. Afterall, what possible good causes could use that money? Hypocrites!!!",
        "label": "yes"
    },
    {
        "text": "Spiderwoman - they published editorials critical of Harper before the last election but still ended up endorsing him, so no, we will not 'get over it'. Bunch of hypocrites/cowering sycophants to their publisher.",
        "label": "yes"
    },
    {
        "text": "knee-jerk anti-Israel pieces and commenters.---------if they are Arabs i can understand where they come frmif they are naive leftists in the west, union leaders, pious clergyman, ivory tower professors, and their ilk ...i CANNOT understand",
        "label": "yes"
    },
    {
        "text": "Are you talking about Harper's evangelical fundamentalist cartel? If so, I wholeheartedly agree. Fundamentalists are a menace wherever they are found.",
        "label": "yes"
    },
    {
        "text": "You need to get over your chagrin that the party led by Justin Trudeau trounced the former government in the October 19 election. Mr Harper's legacy is... wait for it... Prime Minister Justin Trudeau.",
        "label": "yes"
    },
    {
        "text": "So a former Secretary of State and Two-term Senator is, in your mind, worse than a clown with no understanding of how the Government works and what the Constitution says. That soesn't say much good about your thought processes.",
        "label": "yes"
    },
    {
        "text": "Apparatchik - \"lesbian gay soapbox\"? Seriously? Your arguments might be taken more seriously if you didn't feel the need to stoop to name-calling. Shameful!",
        "label": "yes"
    },
    {
        "text": "The \"Christian Church\" was a fraud developed at the Council of Niceae. Brilliantly planned and executed mind you, but a fraud nevertheless. The alleged \"jesus\" had nothing to do with this.",
        "label": "yes"
    },
    {
        "text": "'Canada has fallen to innovation levels of Estonia or Latvia. Way behind Belgium or even South Korea!'What? But that can't be! We're Diverse and thy aren't!It's all about Diversity, like the University of Waterloo! /s",
        "label": "yes"
    },
    {
        "text": "We must keep fear mongering our own children with our climate change exaggeration so we can finally defeat the evil fear mongering neocons?",
        "label": "yes"
    },
    {
        "text": "Prove it and present your evidence to any Crown office in the country and watch the fur fly. You can't prove it and you don't have any idea how the justice system works.",
        "label": "yes"
    },
    {
        "text": "This still doesn't explain why males have an over-inflated sense of confidence while women don't. Oh, and men are never hard on other men? Rii-iight. Time for some actual self-reflection about the whole issue, dear.",
        "label": "yes"
    },
    {
        "text": "It wasn't hard to fact check the stories on Teresa Spence's hunger strike, all you had to do was look at her to know it was all complete nonsense. But our subsidized media told us she was gonna die of starvation!",
        "label": "yes"
    },
    {
        "text": "seems all you have to do is make a broad sweeping mindless criticism of Harper and you get 8 thumbs up from a small bunch of lemmings .....I think I'll give it a try ......Harper is the worst PM Canada has ever had !",
        "label": "yes"
    },
    {
        "text": "Funny thing is, efirla2, Jon StewarT probably would agree with your assessment of his work. But he is exactly the right parasite for the times given the detritus that passes for social discourse in the 'real' news media.",
        "label": "yes"
    },
    {
        "text": "If Lincoln could see the way we were behaving today he would be turning in his grave. The left has ruined the political process with their shrill idiocy.",
        "label": "yes"
    },
    {
        "text": "I had a Chinese student in Eng. Lit at UofT who was a friend of a friend of a friend of a friend of a friend who was actually the student that faced the tanks at Tiananmen. From UofT he went on to a DPhil at Cambridge. He went by the name BigBS.",
        "label": "yes"
    },
    {
        "text": "There IS a 'k' in Etobicoke, it's silent. Go figure, I believe it is a anglicized from an native word meaning 'an area abundant in trees' . I live in Etobicoke and would never vote for the buffoon.",
        "label": "yes"
    },
    {
        "text": "Right on. I'm sure the wise and future leaders of age will rely on the Pokies rather than a few thousand scientists who spend lifetimes measuring changes in our atmosphere and oceans.",
        "label": "yes"
    },
    {
        "text": "Maybe your son could say he wants to be transgendered? Apparently that gets the attention of our provincial government much more quickly......",
        "label": "yes"
    },
    {
        "text": "You are right. Everyone in Canada now speaks Mandarin, and we have a communist dictatorship. You should leave now! Trumpville is calling...",
        "label": "yes"
    },
    {
        "text": "The court does NOT create law - it just tells the politicians to rewrite the laws MORE CLEARLY. And they do and the system works - until some wing nut decides politicians should be dictators beholden to no outside scrutiny. Stupid move, wing nut!!",
        "label": "yes"
    },
    {
        "text": "NOthought8: 30 AM on April 16, 2013What gives you your credentials to contradict him?----------...'Stephen Harper is a role model'?...to who?...so far Steeve's proven, a lying, incompetent,CHEAT!...with the records to prove it eh?!...",
        "label": "yes"
    },
    {
        "text": "Brexit was won by the people who were told so often by Britain's elite educators, politicians and media. to shut the f() k up and to keep their stupid opinions to themselves because they are just a bunch of GD racists and idiots.",
        "label": "yes"
    },
    {
        "text": "And we have two semi pretty blonde bobble heads that frame Harper and nod every time the great Dick-tator opens his mouth for the camera's",
        "label": "yes"
    },
    {
        "text": "Clean hands? Are you kidding. Only leftist hacks could describe Mulcair as having clean hands when he knew first hand of the corruption in Laval and said nothing to anyone. Until now, when other bring it out into the open.",
        "label": "yes"
    },
    {
        "text": "LOL would be interesting to see the Chinese reaction to Canadian's punching their face. Who would be scared by that? But by what Canadian can punch Chinese? A laughing topic.",
        "label": "yes"
    },
    {
        "text": "'...The United States is descending into a civil conflict..'Throw some sawdust under your lefty Canadian self if you actually agree with this. It means you're wanking hard and will need something to soak up your dismay.",
        "label": "yes"
    },
    {
        "text": "ugh, put to rest that argument, it is so false. often people (well, me) will come to the site for the comments in response to articles and enjoy the knowledge that the sludge is not being ingested by everyone.",
        "label": "yes"
    },
    {
        "text": "Trudeau will regret his quote (said many times): 'Mr. Harper wants you to believe thereare terrorists behind every tree, under every rock'. Unfortunately, it just takes ONE treeor ONE rock to do serious damage. A boy in charge, how sad.",
        "label": "yes"
    },
    {
        "text": "Yup, typical leftie who doesn't mind people he doesn't agree with being shot in cold blood. So how does that make you any better than the murderer in Orlando? Oh wait, it doesn't.",
        "label": "yes"
    },
    {
        "text": "Anything that forces Trudeau off of his script is welcome. And these free and open debates will do just that. We'll see and judge for ourselves how Trudeau thinks on his feet... thats why we see some frightened liberal posters below.",
        "label": "yes"
    },
    {
        "text": "Yup all those Wall Street tycoons, dyed in the wool leftists. Some times I wonder how certain people figure out at how to use a keyboard.",
        "label": "yes"
    },
    {
        "text": "Hey Craig, why won't Nick Kouvalis run any relection campaign for Ford unless he goes to rehab??? This has nothing to do with 'Ford haters'. Folks don't like Ford because he is a clownish blow-hard who can't grasp his job.",
        "label": "yes"
    },
    {
        "text": "public health is all of our business as measles is highly infectious and puts added burden on our health care as well as economic costs in lost productivityget your head out of the sand!",
        "label": "yes"
    },
    {
        "text": "Yes that's right. Only you and Fanfret know the path to truth. Which of course is why we dont need a referendum. Because we have Liberal Party hacks and spinners like you guys to design a new system for us.",
        "label": "yes"
    },
    {
        "text": "Coren's position has been the official position of the Church since Vatican II (which incidentally John TOry copied in his ill fated electoral campaign), so its no surprise.",
        "label": "yes"
    },
    {
        "text": "No, the rednecks were lied to by Bush and Powell and Hillary Clinton etc. They were not happy and wanted real conservatives, not draft dodgers like Bush.",
        "label": "yes"
    },
    {
        "text": "Oh really Sean? So if one of those Saudi tankers run aground and start leaking, would that be different from a pipeline leak of oil from Alberta? Do you know what \"hypocrisy\" means little fella?",
        "label": "yes"
    },
    {
        "text": "I saw Bibi interviewed on CNN yesterday. He is an accomplished liar. None of the usual tell-tale signs such as increased eye-blink rate, flushing, fidgeting or hand movement. He could probably fool a polygraph. He's good at it.",
        "label": "yes"
    },
    {
        "text": "\"...the reality is frightening and uncomfortable...\" And which \"reality,\" is that? Whatever one it is, just because it might be \"frightening and uncomfortable\" does not make it TRUE, either. What might make it true is some scientific evidence...",
        "label": "yes"
    },
    {
        "text": "The ultraright can't wait until they can pour hundreds of millions of tax free dollars into think tanks, foundations and institutesto press for their selfish, greedy, viewpoint.",
        "label": "yes"
    },
    {
        "text": "They'd have that money if they would drop their feeble attempts at comedy that are really cleverly disguised attacks on whatever government is in power (at all levels) in the form of satire.",
        "label": "yes"
    },
    {
        "text": "O'leary Code... O'leary=10 Fords; If (O'leary mouth=open); result=venom;If(O'leary leader==conservative party); result = loss; If (O'leary fund== invest); result=loss;O'leary =Trump= disaster;",
        "label": "yes"
    },
    {
        "text": "I hope that you're willing to wager large sums of money on Trump being elected. It will be so pleasant to know you paid a price to be a fool.",
        "label": "yes"
    },
    {
        "text": "Yes, let's dump the shallow analyses of real-life statistics and deny them to fit your bubble agenda. Very funny post if it wasn't so sad.",
        "label": "yes"
    },
    {
        "text": "Russia has not been the aggressor?!! Annexation of Crimea and military support given to Eastern Ukrainian separatists not aggression? Really?",
        "label": "yes"
    },
    {
        "text": "Bravo, Foxy. You are the rare Canuck with clear vision. How colorful of the Globe to have someone from another planet write about the Marxist-racist-Islamist, member of the Muslim Brotherhood who would turn America into a Caliphate if given a chance.",
        "label": "yes"
    },
    {
        "text": "You'd have to read Tom Berger's other works for an answer to your strangely insensitive question, Motihari. You apparently have no understanding of what happens at the confluence of ethnic division and history. BB is obviously no further ahead.",
        "label": "yes"
    },
    {
        "text": "No, Olivia Chow has nothing to do with David Miller's government or Giambrone's bathroom. You are making things up. Please construct an argument based on facts.",
        "label": "yes"
    },
    {
        "text": "They should be on a no fly list.....along with Suzuki, Young, Leonardo, Bono, Christy Clark, Daryl Hannah, Obama and all the other hypocrites who point fingers at Alberta Oil, while ignoring their own actions.",
        "label": "yes"
    },
    {
        "text": "Only young, wealthy Liberal supporters from downtown Toronto should be allowed to vote, ever again. We cannot afford another failure like all governments were before Justin Trudeau's",
        "label": "yes"
    },
    {
        "text": "Hudak is not responsible for the current financial mess in Ontario. Still journalists are after Hudak rather than the premier. They must be the pet-bull of the governing party.",
        "label": "yes"
    },
    {
        "text": "Sure Bud. Can you provide a single instance where voter fraud has in any way influenced a Canadian election? Just one example for the sake of us uninformed liberals?",
        "label": "yes"
    },
    {
        "text": "How does your insightful analysis of what is wrong with Ontario's industrial workers jibe with the $100,000 + grade ten dropouts earn in Fort McMordor driving a truck? How do you like all those TFWs taking your jobs in Alberta?",
        "label": "yes"
    },
    {
        "text": "I have decided that close to half the Canadian population will vote for a liar who tells them what they want to hear. Rather then elect someone who tells a hard truth that challenges comfortable assumptions.",
        "label": "yes"
    },
    {
        "text": "you're welcome not to live in Quebec Keith, how about getting a life not spent pushing your religious privileges in everyone else's face?",
        "label": "yes"
    },
    {
        "text": "Ivy BlackUntil MY agenda is addressed I won't be financing anything by the Church. --------------YOUR agenda? it seems you have YOUR own church alreadyso you should finance your own church",
        "label": "yes"
    },
    {
        "text": "Maybe \"you\" do, but I don't and my friends and family don't. If you want to fry your brain, go for it, but don't take the whole country down with you.",
        "label": "yes"
    },
    {
        "text": "OMG Canadians worry about the silliest things. He is the leader of our Country for Crap sakes. He isn't being paid millions like the CEOs of most corporations. Give it a rest.",
        "label": "yes"
    },
    {
        "text": "Where were you people when the election was going on his father PET was extremely pro aboriginal....the apple don't fall far from the tree...",
        "label": "yes"
    },
    {
        "text": "I'm not completely sure but I think you may be a contender for the most propaganda spewed within a single news article comment section. Congratulations.",
        "label": "yes"
    },
    {
        "text": "Irony know no bounds. Just scratch beneath the surface of the PMO-muzzled Reformists parading as conservatives, and you'll no doubt find plenty of racists and bigots.",
        "label": "yes"
    },
    {
        "text": "Never have we seen such a bias media work so hard to drag a crooked hag across the finish line. It's refreshing to read some honest journalism for once, it took long enough!",
        "label": "yes"
    },
    {
        "text": "Rah, rah, rah. Siss boom bah. You disparage Trudeau but then go on to acknowledge that Harper couldn't beat him and left behind a second place party :)) Some praise. You and Kory Teneycke seem to have been reading from the same page.",
        "label": "yes"
    },
    {
        "text": "Are you calling Margaret a bigot? What, you can't handle the truth? LOL at comparing Wente to Trump. Really, some people are beyond salvation.",
        "label": "yes"
    },
    {
        "text": "David Gibson: 'We need an American news company to keep us honest, eh?'Try dealing with the content instead of attacking the speaker. It's always irrational, and in this case also xenophobic and ignorant.",
        "label": "yes"
    },
    {
        "text": "You want all Conservatives murdered as you stated above. \"I would like to see the whole conservative party placed on ice flows and video tape it as they struggle to survive the melting ice.\" Who is the fascist?",
        "label": "yes"
    },
    {
        "text": "so westernpat when harper did make the similar comments about the Saudi king you were on here posting the same outrage? Just answer that first.",
        "label": "yes"
    },
    {
        "text": "90% of people imprisoned for hate crimes come from public schools. Yep, sounds like there is no problem with the schooling system there hey!",
        "label": "yes"
    },
    {
        "text": "I like the study showing lower IQs correlate highly with right wing tendenciesneed some certainty in your life? like authority? is thinking for yourself too much trouble? vote conservative",
        "label": "yes"
    },
    {
        "text": "Cairo University recently banned all niqabs for professors and staff because everyone found it very difficult to communicate with them and the standards in the university were falling.",
        "label": "yes"
    },
    {
        "text": "Easily said by a guy from BC, where the entire economy is propped up by absurd housing prices kept high through unbridled foreign investment and obscene real estate industry donations to elected officials.",
        "label": "yes"
    },
    {
        "text": "agreed, however none of the others will address the illegal immigration or islamic terrorism problems for fear that they will lose votes from those demographics. So which is worse, DT or continued illegal immigration and increased terrorism?",
        "label": "yes"
    },
    {
        "text": "The oil tax cow was very small in comparison to what Norway did with their oil income. The Alberta cow is now dry and albertians have no one to blame except themselves for being so stupid and greedy. Tough times ahead. Jack Mintz is an idiot.",
        "label": "yes"
    },
    {
        "text": "J632: If you strip out the brainwashed evangelical Christians and their US-Republican preaching, and the gun nuts, virtually nobody voted for the Conservatives. There was al sorts of polling on this issue.",
        "label": "yes"
    },
    {
        "text": "Can someone tell me what is the point of this article. So you want a new hip. Well wait for it fat-butt. Years ago the solution was a cane or crutches.",
        "label": "yes"
    },
    {
        "text": "Yes! Let's get Israel's nuclear weapons banned and banished. This religious state has oppressed and suppressed so much it should not be trusted with WMDs (nuclear and chemical).",
        "label": "yes"
    },
    {
        "text": "One of the longest produced newspapers in Canada should be sanctioned for allowing one article? You are being ridiculous. Its called freedom of the press.",
        "label": "yes"
    },
    {
        "text": "So if the Leader of a country says we can't do anything about climate change because it will destroy the economy you're saying he is an extremist? Is that what you're getting at here?",
        "label": "yes"
    },
    {
        "text": "One World Government? Oh dear, you have been listening to those right-wing American radio talk show hosts a lot lately, eh? Watch out for those black UN helicopters!",
        "label": "yes"
    },
    {
        "text": "It wasn't your policies, Jenni. It was you and yours... the cynical, nasty, negative, curmudgenonly way that you, Harper and your accolytes conducted yourselves. You still don't get it.",
        "label": "yes"
    },
    {
        "text": "Wow, TO must be an interesting city, full of bile and incoherence. Your opinions of your fellow citizens have nothing to do with the scientific evidence for global warming.",
        "label": "yes"
    },
    {
        "text": "pierre polivier has got to have one of the most punchable faces in the history of canada. of course the cons dont want electoral reform. this broken system is the only reason they won any election in the first place.",
        "label": "yes"
    },
    {
        "text": "I wanna know how Toronto city council can give a subway to Vaughan, given that Vaughan, while undoubtedly a nice place, is not part of Toronto. Reality is so ugly.",
        "label": "yes"
    },
    {
        "text": "' . . . the UN Security Council is blocked by the Russians who are being their usual ruthless selves . . 'Easy with the stones there, kettle . . . Go back to your glass house!",
        "label": "yes"
    },
    {
        "text": "Swing and a miss, Globe. There's nothing wrong with insisting on value for government spending, whether on small items or large. Or do the Globe's editorial writers think it's impossible to walk and chew gum at the same time?",
        "label": "yes"
    },
    {
        "text": "... so no critique of the article, just straight to personal attacks. Do you even read the G&M? Your posts are just 1- liners like above, and never actually address the underlining article.",
        "label": "yes"
    },
    {
        "text": "Stupid Arguments, move on, quit trying to analyze history with Today's perspective. This mentality would erase History and is the ultimate Feminist Political Correctness.",
        "label": "yes"
    },
    {
        "text": "She's an empty shell... She has risen politically far beyond her abilties or intellect. She will be known as the 'Photo Op Premier' as a short footnote in BC political history.",
        "label": "yes"
    },
    {
        "text": "Expecting locgic or truth from a moonbat is like expecting a Stanley cup from Toronto - even if it looks like its possible - it ain't really.",
        "label": "yes"
    },
    {
        "text": "More display of your bigot world. When one has nothing positive to say he should shut up. A rule you seem to ignore because of your attitude based on ridicule or redneck behaviour.",
        "label": "yes"
    },
    {
        "text": "So, I know that the right-wing media has a fairly strong lead in hot babes, but is there a right-wing journalist that the Cons consider humorous... or, do the Cons laugh at all?",
        "label": "yes"
    },
    {
        "text": "Some of us knew this only too well right from the start but we were branded racists and rednecks. What do you learn from that particular anecdote? (nothing I suspect in most cases)",
        "label": "yes"
    },
    {
        "text": "Moderate Muslims need to start making their voices heard about the folly of their extremist counterparts. Until then, it's just so much useless hot air.",
        "label": "yes"
    },
    {
        "text": "You yourself hate Western principles. What's your opinion on gay rights? If your comments on here are any indication, exactly the same as the Muslim point of view!",
        "label": "yes"
    },
    {
        "text": "The media - the Enlightenment merely set the stage for the Industrial Revolution. And RPerrin is right - theocratic obfuscation is alive and well - from religious to political nostrums.",
        "label": "yes"
    },
    {
        "text": "Hawaiians hate whites, have you ever been to Hawaii the natives will literally shit in your face and spit in your food- nobody batts an eye. The open racism towards white people is on another level. Just don’t talk back to the natives and you’ll be fine; otherwise, you’ll leave the island with two black eyes and no one will care not even the cops.",
        "label": "yes"
    },
    {
        "text": "Elizabeth is talking about a grownup coming to be mayor of Detroit, and one who never grew up, who got to be mayor of Toronto on the Conservative lower-tax mantra. What would that do for Toronto over time?",
        "label": "yes"
    },
    {
        "text": "The Globe and other MSM outlets regularly delivered dissections of Harper's psyche and how he was 'cold' and a 'control freak'. Lawrence Martin even wrote a whole book on the subject. Liberal supporters need to put on their big boy pants.",
        "label": "yes"
    },
    {
        "text": "Donald Trump twitter followers - 17.4 millionElizabeth Renzatti twitter followers -8000 (most / all of them in the GTA)Elizabeth - you're an irrelevant GTA Liberal whiner.",
        "label": "yes"
    },
    {
        "text": "One quote from one selected sight is considered by you as being enough proof to justify your position. I doubt you really care about finding the truth. It seems your objective is to find something negative to say about Wente.",
        "label": "yes"
    },
    {
        "text": "Mike: If indeed you are not just trolling, then you are incredibly STUPID! Perhaps you should consider running for the mayor of Toronto, to replace another of similar intelligence.",
        "label": "yes"
    },
    {
        "text": "Ford and Harper should get no credit because they are big bad evil right wing fascist meanies. This one time, I saw Ford punch a kitten. This other time, I saw Harper steal a bowl of soup from a homeless guy.",
        "label": "yes"
    },
    {
        "text": "There is no, nor has there ever been a country called Palestine. The so called Palestinians are entitled to nothing. They should go back to the Arabs countries they come from.",
        "label": "yes"
    },
    {
        "text": "I think you have to include a 'winkee face' for some people to get sarcasm. But I'm not a 13 year old girl so I never include it either.",
        "label": "yes"
    },
    {
        "text": "The Magna Carta and Habeas Corpus ... all fine and well. Perhaps Ms. Macklin can explain how these concepts fit into Islam's ideology of Jihad and Sharia Law.",
        "label": "yes"
    },
    {
        "text": "Ok, you've never met Trump but you support him, how by your own logic does that make sense? And you didn't read the column so how can you comment?",
        "label": "yes"
    },
    {
        "text": "Joey, You're rudeness is indicative of what stock you come from and how you've been educated. I'm a capitalist, LOL, and conservative, but you can't figure it out?",
        "label": "yes"
    },
    {
        "text": "And this loony opinion of yours is based on what exactly? Your gut? If the potheads you know are losers that's your problem, I could say worse about boozers, so what's your point? Just don't have one, how pathetic.",
        "label": "yes"
    },
    {
        "text": "Bliss is a conservative and one time supporter of Harper. Gawd, how do you Harper propagandists stand to look at yourselves while shaving? Or are you too young to shave.",
        "label": "yes"
    },
    {
        "text": "That my comment has gotten under your skin with such little effort on my part gives me more pleasure that I can relay to you. Thank you. The bonus is that the quality of your comment proves Mill's point.",
        "label": "yes"
    },
    {
        "text": "One doesn't have to look to Facebook for fake news. Who remembers Hillary 'dodging sniper fire', or Brian Williams of MSNBC and his lies about Iraq and helicopters, or the Rolling Stone campus rape story?",
        "label": "yes"
    },
    {
        "text": "Renzetti and the rest of the Globe's snobs should read Thomas Sowell's devastating characterization of modern upper crust certitude: The Vision of the Anointed: Self-Congratulation as a Basis for Social Policy",
        "label": "yes"
    },
    {
        "text": "Even Bill Maher is talking about the gay mafia. One of the core tenets of Western society is free speech and the right to hold different views. Not though when it comes to gays - you either agree with their views, if not they'll try and destroy you",
        "label": "yes"
    },
    {
        "text": "Amazing how the federal political partys/politicians can not bring about the wish of most Canadians and close Canada's useless Senate. Weird politicians in what is often a weird country. Canadian voters leave a lot to be desired.",
        "label": "yes"
    },
    {
        "text": "The 'birther' scenario is Donald Trump's genesis of racism.. I know you are just like Trump. You hate immigration even though your ancestors are not from Canada. I suppose you also hate the First Nations. Not surprised.",
        "label": "yes"
    },
    {
        "text": "Wow. Such naivety and delusion. All for a man that has hoodwinked so many Americans into thinking he has the answers. Canadians don't any part of this disaster. America is on it's own with on one. Good luck!",
        "label": "yes"
    },
    {
        "text": "Government union control over and taxation of marijuana sales. This will succeed where the war on drugs failed. MJ wont be cool to use anymore.",
        "label": "yes"
    },
    {
        "text": "You have a point if no one is being raped, murdered, sold as slaves, tortured ... Otherwise, the pointed is on your tiny little head. Moral decrepit.",
        "label": "yes"
    },
    {
        "text": "The Globe showed its true colours in taking so long to address such a slur on its watch. Old-stock media dutifully serving an old-stock audience, nicely aligned with Harper's fear mongering. Oh, for a new Canada.",
        "label": "yes"
    },
    {
        "text": "The Work Farce - Honest, compassionate Canadians need to support Bernie Sanders. Why - do we get to vote in the US presidential election?",
        "label": "yes"
    },
    {
        "text": "Same question to you. If I'm wrong, how many 600 foot tall industrial wind turbines do you see all along the shoreline from Hamilton to Oshawa? Hmmmm? I know more about this subject than you, I can guarantee it. Wanna try me?",
        "label": "yes"
    },
    {
        "text": "Just bring some intelligent conversation, if you have any. Looks doubtful based on past experience.(BTW, I thought it was Harper was was responsible for the world price of oil?)",
        "label": "yes"
    },
    {
        "text": "So are you saying only university educated adults can decide when to take lunch, vacation and breaks? Education doesn't bring intelligence. How stupid you are.",
        "label": "yes"
    },
    {
        "text": "Or if you read the truth (Party of One; Kill the Messengers) you may be able to pull your own head out of your echo-chamber-nether-end.",
        "label": "yes"
    },
    {
        "text": "'So you, a white male, consider yourself the chief arbiter of what is sexism to women or what 'real sexism' is? You. Are. Clueless.'I'm female, and consider myself a feminist, as many of my other comment history will show. Just not an extremist one.",
        "label": "yes"
    },
    {
        "text": "except Wynne didn't smoke crack, make as ass of herself in a drunken stupor several times, demonstrate a startling lack of understanding of even the basics of how her job works, etc. But you're right, it's totally the same.",
        "label": "yes"
    },
    {
        "text": "Onward Christian soldiers marching off to war... Anyone still wanna buy those F-35s,ah,ah,ahhhhh? This, is the price you pay... Highway of hero's??? More like highway of fools...",
        "label": "yes"
    },
    {
        "text": "'...the gay community tries to hijack every opportunity to promote their deranged lifestyle.'-expatdudeYou'd prefer they promoted Ford's deranged lifestyle instead?",
        "label": "yes"
    },
    {
        "text": "sirencall, take this up with Margaret Wente \"The majority of people charged with murder, rape and robbery are either first- or second-generation immigrants. \" \"Sweden?s ugly immigration problem\" - Margaret Wente - Globe and Mail - Sept 1, 2015",
        "label": "yes"
    },
    {
        "text": "Okay, I made this point, you agreed with me, and then you stole it.Please don't agree with me. You are behaving in a bigoted manner towards French-Canadians, and I don't support that.",
        "label": "yes"
    },
    {
        "text": "One might think a former Nortel employee working in the field of neurological imaging should be smart enough to realize that a transparently fake 'oh I hope this doesn't happen' would be no shield at all. But then stupidity comes in many forms.",
        "label": "yes"
    },
    {
        "text": "While you are okay with a government that runs on lying, cheating fraud and perjury. Your Family Values must include lying, cheating. fraud and perjury.",
        "label": "yes"
    },
    {
        "text": "Donald Trump is a sociopathic con artist, and most of the people who are falling for his act are angry and of below average intelligence.",
        "label": "yes"
    },
    {
        "text": "A very long winded explanation that is essentially saying:'The general public is too stupid to make this decision, only the wise Liberals should choose what is done.'Typical Liberal.",
        "label": "yes"
    },
    {
        "text": "And naturally, you can't comment on the article on the CBC. Because the CBC knows what the comments would be like. CBC rarely likes the truth.",
        "label": "yes"
    },
    {
        "text": "'am not beholden to any food safety regulations.'----------And of course, we all know that the main goal of meat producers is to poison people. What could be better for profits than that?",
        "label": "yes"
    },
    {
        "text": "Thanks K Wright I am at a loss on what to say about this authors conscious and deliberately misleading piece of tripe and your words are spot on.",
        "label": "yes"
    },
    {
        "text": ", By the way, is this moon howler post a new G&M thumbs down record???? Or does Bodaydohead still own that? Bodaydohead/moonhowler ..... one in the same anyway ..... that being, braindead..",
        "label": "yes"
    },
    {
        "text": "lWell ... we cant help stupid can we ? So we should create more laws , so we can put put more people in jail so people like you feel secure in their smugness ..... and the carnage on our highways will continue .....",
        "label": "yes"
    },
    {
        "text": "Poor DS.He's really taking a beating here from the anti-Muslim anti-immigration bigots. All the usual lies and stereotypes pulled out from under rocks.",
        "label": "yes"
    },
    {
        "text": "Rich, Precisely. Fascists are not shy and retiring. They enjoy being fascists and they want the whole world to know they're proud of it. Americans have been \"friendly\" fascists for decades. Trump legitimiizes being angry fascists.",
        "label": "yes"
    },
    {
        "text": "Trump is not using race as an issue? You mean he is welcoming to Blacks, Latinos and Muslims to his rallies? What is the evil agenda that you speak of?",
        "label": "yes"
    },
    {
        "text": "Yes, we can learn a lot from the ferry sinking and that spoiled airline exec who made the plane turn back because the peanuts were in a plastic bag.",
        "label": "yes"
    },
    {
        "text": "So any country that isn't up to our virtuous Canadian standards should be set right. Let's see... that means... the rest of the world. Okay, Bob, we'll get right on it.",
        "label": "yes"
    },
    {
        "text": "A slang word blacks use to refer to police is racist if uttered by anyone except a black person and for their exclusive use? Seriously?",
        "label": "yes"
    },
    {
        "text": "That's correct, IanC. Actually - it may have been the many douzens of homophobic comments you've posted on this board over the years that inspired me to give my vote to Kathleen Wynne.",
        "label": "yes"
    },
    {
        "text": "That exaggerated attitude is itself inimical to democracy. More like a scapegoatocracy. If hypocrite liberals don't respect Trump and his tens of millions of supporters, why should they respect liberals and their evil ways?",
        "label": "yes"
    },
    {
        "text": "You sound as if you and your family are immune to emergency's. Perhaps those other people who have emergency's should be less protected.",
        "label": "yes"
    },
    {
        "text": "That's right, because helping people continue their drug addictions is the same as a defining symbol of our country. That does seem rather silly, doesn't it?",
        "label": "yes"
    },
    {
        "text": "The author of this article is either fully ignorant, delusional or both. I urge everyone reading such drivel to think for themselves and realize how asinine these anti gun puff pieces are.",
        "label": "yes"
    },
    {
        "text": "'Much tougher economic sanctions are needed'====='Hee haw hee haw!' brayed the empty-headed shill. What is the objective of sanctions? What outcome would they be set up to achieve?",
        "label": "yes"
    },
    {
        "text": "Yes he is shallow and that is how he decides if what Harper says is bad or not. I do love the hypocrisy of the Harper haters as Trudeau used the same term in 2007 and Stephane Dion in 2014, of course when Liberals use the term it is acceptable.",
        "label": "yes"
    },
    {
        "text": "I don't think the ordinary female soldier thinks this way....just the FemiNazis who would never fight on the front lines with those horrible beasts... men.",
        "label": "yes"
    },
    {
        "text": "Obsess much Stew? How about stamp collecting? That's a good way to pass the time. Or building ships in bottles? mAybe watercolours? All good hobbies. Seems like you need one.",
        "label": "yes"
    },
    {
        "text": "I'm so sick and tired of the lies and deceptions that are propagated non-stop by the media. Hopefully a backlash is coming and people will wake up to reality.",
        "label": "yes"
    },
    {
        "text": "except she supports canada being subjugated to a foreign inbred family of dimwitted billionaires forever. For that reason alone, i will not vote green.",
        "label": "yes"
    },
    {
        "text": "To speak the truth can be so immature and childish to those who refuse to think! To add some truth, you could have mentioned that Harpo's presence in the building is shameful enough!",
        "label": "yes"
    },
    {
        "text": "Mark Shore 'Are the Conservatives playing politics with terror?' Does the question even need to be asked?----------it needs to be asked as an exercise for leftists to learn how to THINK",
        "label": "yes"
    },
    {
        "text": "The purpose of secular democracy is to allow people to worship and observe their religious practices in freedom without oppression from a central religion, or from religion-haters such as yourself. Please go read some Thomas Jefferson.",
        "label": "yes"
    },
    {
        "text": "How would anyone with any sense of probity appoint this naive simpleton as our Minister. Had he not demonstrated the same delusionary behaviour as head of the LPC, his choice might be overlooked. We are being governed by a bunch of nouveau idiots..",
        "label": "yes"
    },
    {
        "text": "The only feminist that comes out looking good in this sham is Marie Henein, Ghomeshi's lawyer. A very intelligent woman that doesn't give a crap about feminists claiming that they are disadvantaged but just proves them wrong.",
        "label": "yes"
    },
    {
        "text": "There should be a law for posting on the internet the same as driving a car. If I have to read another one of these uninformed posts from a naive 15 year old on their lunch break I'd go ask my neice. ",
        "label": "yes"
    },
    {
        "text": "The Liberals were put in place by the public sector and their unions with lots of help from the media. It's truly amazing with all that help 61 percent said no.",
        "label": "yes"
    },
    {
        "text": "Is this the plank or pillar of his platform? Way to get going Justin. Double dipping makes more sense if you are stoned however we are no oreo cookies. I'd rather vote for Big Bird.",
        "label": "yes"
    },
    {
        "text": "So you are OK handing presidency over to a criminal who set Libya, Egypt and Syria on fire, is in cahoots with corporate donors and who is being investigated by the FBI? You must have voted for Wynne.",
        "label": "yes"
    },
    {
        "text": "How do you know that there was a medieval global warming. Did you personally experience it? Oh, scientists told you about it and you believe them. The same scientists who you disbelief when they talk about global warming.",
        "label": "yes"
    },
    {
        "text": "Everybody must unite behind Hillary. Stop the fascist Trump at any cost. If he is elected billions of peoples lives will be in jeopardy! Vote for Hillary and sanity! Trump is racist, anti-semtic, Islamaphobia and homophobia!",
        "label": "yes"
    },
    {
        "text": "Obviously a con-pawn. Witness the old partisan hackism that if you're not a Conservative supporter you must be a \"Lib/NDP partisan supporter.",
        "label": "yes"
    },
    {
        "text": "obama class? obama diplomatic? obama is a narcissist nut job of left wing my way or the high way bs, having never worked with congress on anything",
        "label": "yes"
    },
    {
        "text": "He will be fed, housed, given books to read, the chance to take courses, all things his victims have lost forever. How is that 'torture'? Are you a lawyer, by chance??",
        "label": "yes"
    },
    {
        "text": "And speaking of PR Ms. Wente, nice little PR piece for Israel. I'm not saying you're wrong about the motives of Hamas but I have a hard time feeling sympathy for Mike Tyson when he's throttling a toddler.",
        "label": "yes"
    },
    {
        "text": "Who picked these Canadians for this list ?So many good choices ignoreg. So we know David Suzuki is more popular than and accused child molestor on this list. Congratulations David.",
        "label": "yes"
    },
    {
        "text": "Utter nonsense. Only the religious ignore overwhelming evidence of the absurdity of their beliefs yet pride themselves on their blind faith.",
        "label": "yes"
    },
    {
        "text": "What will the spoiled students in Quebec do now that their tuition will spike without that hated oil money? They can try banging pots again I guess.",
        "label": "yes"
    },
    {
        "text": "I picture a sort of Dantean theme -- the grey-haired damned driven in masses around an auditorium by a demon contingent of slick brats in short pants.",
        "label": "yes"
    },
    {
        "text": "The countries that opened there doors to immigration are all losing their customs and values. Immigration was the worst thing that hit the planet after WWll.",
        "label": "yes"
    },
    {
        "text": "I couldn't get past the incredibly ignorant line where Wente claims most city people are against hunting....What an ignorant fool she is...",
        "label": "yes"
    },
    {
        "text": "I agree with you Rob. The author also offers no solutions to the problem. We have been seeking solutions for decades. It's not easy or it would have been solved by now. Not gonna rain on my parade.",
        "label": "yes"
    },
    {
        "text": "Not only is it a lost cause so long as islam is its answer regardless of the question or issue at hand, the so-called 'islamic world' should be blockaded, quarantined, and sealed off from the civilized world.",
        "label": "yes"
    },
    {
        "text": "Next up will be legislation requiring all civil servants to wear short pants. After that, a debate in the House on the menu in the cafeterias.",
        "label": "yes"
    },
    {
        "text": "It's not sleazy?.it's done all the time in the private sector. Which government do you work in?Perhaps get informed before making comments?",
        "label": "yes"
    },
    {
        "text": "we can only conclude that Dick's pathological hatred of the Canadian military comes from being told he wasn't good enough to join! Mentally, physically and ethically!!",
        "label": "yes"
    },
    {
        "text": "Rubbish headline and column. Expect a lot better than this from a Globe contributor. The writer should apply for a job with Fox News or with the Republican party. Pitiful.",
        "label": "yes"
    },
    {
        "text": "No, every Con played up the Liberal problems, like poor drunk Ralph Klein squalling about the NEP and transfer payments. Even as PM Harper played up the NEP. And the dumber members of Canadian society fell for it every time.",
        "label": "yes"
    },
    {
        "text": "You could not be more wrong. Wanting change and voting as you see fit are not equal to being a Nazi. Blanket statements are rarely accurate. In your case more like just plain stupid.",
        "label": "yes"
    },
    {
        "text": "DenF you are completely out to lunch on the serial killer claim and that type of extreme nonsense discredits anything else you have to say.",
        "label": "yes"
    },
    {
        "text": "Officemat ...your comment just shows you know just enough law to be dangerous.....your comment has truth, but no accuracy or substance that stands up to proper scrutiny. Stick to being a mat not an arm chair lawyer.",
        "label": "yes"
    },
    {
        "text": "Wow! Never thought about it, but: 'democracy always slides into fascism' is an interesting idea. I will say that populism does take democracy into some pretty ugly places.",
        "label": "yes"
    },
    {
        "text": "That's why we should stop allowing Muslims into Canada. It may not be the parents that want to do us harm but in many cases it's their offspring.",
        "label": "yes"
    },
    {
        "text": "Yeah Dougie boy, and there's no Muslim tide either. When are you going to stop denying that there are problems in this world and come out of your little cocoon?",
        "label": "yes"
    },
    {
        "text": "Rmiller101 30 minutes ago Pretty clear that potheads are controlling the voting patterns at the G&M. ================================== And this from the guy who upvotes himself. Stay classy, big guy. .",
        "label": "yes"
    },
    {
        "text": "I prefer CTV for the news. As for CBC radio, it is so biased that it is embarrassing. On a science special, they started to rant on the Koch brothers. That is politics. Quirks and Quarks is biased by politics. The music is fine though.",
        "label": "yes"
    },
    {
        "text": "American's used polite language and nuance to excuse years of slavery. Sometimes you have to call evil, evil. China and Taiwan are not the same country. Taiwan is separate. Time to acknowledge facts. No matter what the despots in Beijing think.",
        "label": "yes"
    },
    {
        "text": "So your belief trumps his then? Isn't this what this whole argument is about? Belief? If you believe he has no degrees come up with such evidence?",
        "label": "yes"
    },
    {
        "text": "Hugh, Your premise is wrong as well as your conclusions but they fit neatly with your ingrained biases, though. Do some research. Read the article I posted above.",
        "label": "yes"
    },
    {
        "text": "Yet another poor little dh!mm! jihadist apologist spewing the usual 'blame the victim Western self-loathing-addled' drivel. Do you really believe that paying your 'dh!mmi taxes' will save you in the cal! ph@te?",
        "label": "yes"
    },
    {
        "text": "Interesting that you say she 'looks like a person...'. Hmmm... you make these wrong-headed judgments based on how she looks. Because she wears a hijab. The broken one is actually you.",
        "label": "yes"
    },
    {
        "text": "Are you kidding? You did notice that author posted her picture with the article? Why post a picture if others aren't to look at it, to assess what it means to them? I see a woman emulating Bozo the clown, but she got the colours wrong.",
        "label": "yes"
    },
    {
        "text": "Who cares about the Reform Party or Back in the Day? If Back in the Day is so important to you why not dream about how your Liberals used to be in power and are now just 3rd rate also rans.",
        "label": "yes"
    },
    {
        "text": "Lots of backslapping and premature congratulations by political hacks and mainstream media shills, doing the 'circle jerk', with how well things supposedly went.",
        "label": "yes"
    },
    {
        "text": "Let me know how that works for you. Oh, and don't forget to add Cuba to the list, seeing as how little boy wonder things Fidel and the thousands of murders by Castro were such a good thing.",
        "label": "yes"
    },
    {
        "text": "I've never seen such a bunch of psuedo scientific mumbo jumbo in one paragraph in my life....Sounds like you read way too much 'Popular Science'.",
        "label": "yes"
    },
    {
        "text": "The Health Minister? That means jack squat. Trudeau also said FATCA was an assault on our sovereignty (it is), and now he loves it. Same for Brison and Goodale. Maybe they've lied so much they can't remember.",
        "label": "yes"
    },
    {
        "text": "LightofZ Less than a minute agoAn ignorant comment: one can, in the same manner, write that people who vote for the Liberal party don't posses enough intelligence to understand Harper.",
        "label": "yes"
    },
    {
        "text": "Well then, johnny boy--you clearly imply that you know what a psychopath is, but fail to follow through by providing us with a demonstration of your dazzling intellect. Maybe you can look up the definition of popinjay and get back to us.",
        "label": "yes"
    },
    {
        "text": "dude, im a Conservative making an argument that the CPC will win the next two elections with majorities. Perhaps you comprehension of writing is an issue here. Reread the comment, and save yourself a little dignity.",
        "label": "yes"
    },
    {
        "text": "LOL, Even after 2 years now, you lefties still cling to what passes (to you) as math... What part of 'you lost the election, bigtime' don't you understand?",
        "label": "yes"
    },
    {
        "text": "And aren't you just salivating at the idea of getting some kid of revenge. I invite any race or culture that has never 'sinned' to throw the first stone...",
        "label": "yes"
    },
    {
        "text": "Who needs to reach. The Wynne team provide a bumper crop of low hanging fruit. Not unlike Christy's BC Liberals they both belong to the scandal a week club. Definitely Guinness material.",
        "label": "yes"
    },
    {
        "text": "nah the G&M is just actvly campaigning for their election endorsement, I mean if the Liberals all pack up and dissapper they'll get their haperless CPC government! :)",
        "label": "yes"
    },
    {
        "text": "The Canadian Voter - beleive me- was considered to be be a bunch of sheep who could be shepherded by the messiah Harper. now the truth is out in the open - the Canadian voters are not a bunch of sheep and Harper is a sitting duck.",
        "label": "yes"
    },
    {
        "text": "Scammer really is kind of hostile isn't he? Must be the dampness in his mother's basement. You would think though that if he was going to call someone a nasty name he'd spell it correctly.",
        "label": "yes"
    },
    {
        "text": "They're now in full panic mode. You wanna know how many posts that I have had pulled in the last 24 hours, Duke ?I am not even a biased Trumpatista like you.",
        "label": "yes"
    },
    {
        "text": "The sad part is that the ads are aimed at the stupidest Canadians, those too dumb to think for themselves, so they need Harper to tell them how to think. Fortunately over seventy percent of Canadians are smart enough not to fall for it.",
        "label": "yes"
    },
    {
        "text": "But it was okay to put drug dealers under house arrest so they could wander into the Eaton Centre and shoot it up, right? Wouldn't want a violent criminal with an illegal handgun in prison would we Liberals?",
        "label": "yes"
    },
    {
        "text": "Really? You feel this column is arrogant. I guess I missed the 'peasant' comment. You don't have to be a peasant to vote for Trump. You just have to be as dumb as a rock!",
        "label": "yes"
    },
    {
        "text": "Right on! Each time Harper opens his mouth, I?m reminded of, ?I did not have sex with that woman,? and ?It?s not a crime, when the president does it.?",
        "label": "yes"
    },
    {
        "text": ">So in your own words, what IS going on then? (No conspiracy theories on oil, and pipelines and Jews and military-Industrial complexes please! And definitely not UFO's)",
        "label": "yes"
    },
    {
        "text": "Query- Do you just comment on articles in the G&M to display your disdain for Canadians? Fine if it gives you pleasure- but it seems a strange pastime.",
        "label": "yes"
    },
    {
        "text": "Look up the word 'purport' JB, clearly you don't know what it means or have the ability to read my full sentence. You either have an amazing ability to hear exactly what you want to hear, or you are incredibly intellectually dishonest.",
        "label": "yes"
    },
    {
        "text": "Hey, now, crownline, the people who agree with the author of this comical tome obviously don't care about such details. Heck, they prefer the idea that the only cheating ever done comes from the right! Don't bother them.",
        "label": "yes"
    },
    {
        "text": "Oh Prog111, what Andrew stated is true. It's telling that what he said is less of an issue with you than to whom he was referring. Poor Prog111.",
        "label": "yes"
    },
    {
        "text": "Just try getting to a decision maker anywhere in that department that will step up on issues like this - IMPOSSIBLE. If someone at the Embassy was able to do something for you - you must be golden!",
        "label": "yes"
    },
    {
        "text": "You don't need supreme brilliance, you just have to pay attention to what the experts are saying instead of the dummies in the coffee shop.",
        "label": "yes"
    },
    {
        "text": "Way to go solus for calling it straight- good ole cowardly anne nonymous is just cheap. what do you do for a living anne? you're certainly not an artist- maybe a mortician with that kinda gloomy personality.",
        "label": "yes"
    },
    {
        "text": "'when will you be insisting on common public washroom facilities for men and women?'That's the kind of specious argument you'd expect from a 'Islamapologist'....",
        "label": "yes"
    },
    {
        "text": "Ah, when you cannot debate and add to the topic at hand, play the victim card, if that does not work, pull out the conspiracy card. It is getting truly pathetic.",
        "label": "yes"
    },
    {
        "text": "The Hillary campaign is terrible at name calling.. All Trumps supporters are deplorable and irredeemable and Bernie's supporters are all basement dwellers.. She has names for everyone. I wonder what she calls her own supporters? Suckers, I guess.",
        "label": "yes"
    },
    {
        "text": "You make the mistake of tarring all municipal leaders with the Rob Ford brush. There are lots of hard-working, intelligent, ethical mayors who don't spend their spare time sucking on a crack pipe.",
        "label": "yes"
    },
    {
        "text": "Don't confuse 'big' with 'best'.Chicago and Vancouver have excellent airport rapid transit connections. Toronto has the 'Airport Rocket'....big league... or bush league?",
        "label": "yes"
    },
    {
        "text": "This isn't Euro-weenie land, this is North America, where Ordinary Canadians and Americans don't give a rat's arse about this leftist propaganda, and happily eat our GMO food next to our steaks and ribs.",
        "label": "yes"
    },
    {
        "text": "The Libs in their infinite wisdom decided a shiny pony camp councillor was much better that a highly educated astronaut. Yup, the libs are always the smartest in the room.",
        "label": "yes"
    },
    {
        "text": "Super Mario didnt make the Italian team and that was because of racist. Europeans need to be more African and Muslim. Give it time it will happen!",
        "label": "yes"
    },
    {
        "text": "Seth, there's help for people like you with mental challenges. Somehow, you can't grasp the concept of people's freedom to vote as they wish",
        "label": "yes"
    },
    {
        "text": "Give me a break. There is precisely zero comparison between actual slaves and metaphorical working 'slaves' of today. If you think otherwise, you need to refer to history books for some facts.",
        "label": "yes"
    },
    {
        "text": "So, everyone who disagrees with her - and YOU - are fascists? You're just another pouting SJW, angry that you didn't get a 'Participant' trophy...",
        "label": "yes"
    },
    {
        "text": "Well said, Slippery Slope. This newspaper has EXACTLY the kind of ethics of the government it supports and the columnists it chooses to promote and defend -- a NAMBLA promoter and a recidivist plagiarist. 'Disgrace' is precisely the right term.",
        "label": "yes"
    },
    {
        "text": "RACIST! Expecting everyone to be treated the same? MONSTER!I'm calling the Human Rights Commission. Expect a kangaroo to be at your door soon.",
        "label": "yes"
    },
    {
        "text": "I always get a kick out of the fascist who can't read. Of course if they could they wouldn't be facsists now would they. Google 'rail valdez' you halfwit.",
        "label": "yes"
    },
    {
        "text": "> Yes, that clang you hear is the top of the dustbin closing. Sounds exactly the same as your mind closing. I suppose they are exactly the same thing.",
        "label": "yes"
    },
    {
        "text": "Oh deer: Hitler really! I have nothing but respect for Jews, they are truly a remarkable people. It's you retread, left wing , tambourine banging, pot circle sloths I have no time for. Ps love your conspiracy theories, do you hear voices?",
        "label": "yes"
    },
    {
        "text": "How many friends issued from recent immigration do you have? How many co-workers issued from immigration do you have sitting next to you?",
        "label": "yes"
    },
    {
        "text": "'What really offended the Paris attackers? Democracy'Oh, please, spare us the sophomoric re-interpretations. They were offended by cartoons about their 'prophet'. It's crazy and evil, but sufficient without pseudo-intellectual 'analysis'.",
        "label": "yes"
    },
    {
        "text": "'@croc--so you're with Ford, buses and streetcars should be free? How would you have paid for them?'$1.3 billion for buses and streetcars??!! What, are they gold plated??",
        "label": "yes"
    },
    {
        "text": "You know it really does get rather tiring when in the States it is always the race card for the blacks . Up here in Canada is always the race card with the Aboriginals. Seriously this is getting to be so damn sickening.",
        "label": "yes"
    },
    {
        "text": "AB, when you are a conservative, all the Enviro nut jobs like you come out and protest everything. That is why, Obama builds pipelines with NO protests or without talking to anyone.",
        "label": "yes"
    },
    {
        "text": "Trust the Globe to run an editorial discussing Baird's use of English only, rather than taking him to task over his incessantly stupid comments. In English or French, the man's a disaster.",
        "label": "yes"
    },
    {
        "text": "Go back to grade 5 and learn some Canadian History sonny. Do some research before commenting and revealing how ignorant you are of Canada's contributions since 1950.",
        "label": "yes"
    },
    {
        "text": "C'mon, Wente! If these privileged no name celebs weren't sticking their nose in others' business, what would they do with all that dead air time?",
        "label": "yes"
    },
    {
        "text": "Political Scientist1 3 hours agoThe paid hasbara trolls and the sycophant G&M Censors on this thread have been really busy overnight!! ______i see more paid naive leftists in the west trollsG and M censors are moderators",
        "label": "yes"
    },
    {
        "text": "Spare everyone your drivel you rambling fool. Your chance to work toward prosperity was not stolen. You're just too stupid and/or lazy.",
        "label": "yes"
    },
    {
        "text": "I know - that's what the 'deep' analysts would like us to believe. She is basically a con woman, who got into her role so deep and benefited so much that she started to believe her own lies.",
        "label": "yes"
    },
    {
        "text": "And you are so naive that you do not think there are a lot of unreported rapes in US. I call it being wilfully blind. Whatever bad happens, happens with other people and not us.",
        "label": "yes"
    },
    {
        "text": "I think school boards tend to use the instrumental version, anyway. It wouldn't be as onerous as task as you'd think. After all, it's been done before, more than once.",
        "label": "yes"
    },
    {
        "text": "Merkel was a dud on Greece but hats off to her for her response to the refugee crisis. If little Germany can take in so many, why can't Canada? It puts us to shame. We are no longer a can-do nation, but a can't, won't, don't-want-to-know nation.",
        "label": "no"
    },
    {
        "text": "Stevie ties the keystone tars sands pipeline to the 'facts 'he makes up. Theologically driven political entities do not recognize true science. True science goes against the religious dogma they base their platforms on. Enough said here folks!",
        "label": "no"
    },
    {
        "text": "Classic Fox News talking point. If someone intends to dress as a woman to enter a woman's bathroom and assault a female therein, they will do that regardless of whatever bathroom laws there are. This is about transgenderism, and not cross dressers.",
        "label": "no"
    },
    {
        "text": "Solar panels and installation from home depot were piloted in the Ottawa Market. The trouble was panel prices fell so quickly that consumers were able to get a better price from the independent installers as Home Depot prices lagged the market.",
        "label": "no"
    },
    {
        "text": "Weird, you miss the point. Our 1.5% (and that's what it is for 2013) is insignificant. Yes we will suffer the consequences of climate change but there is virtually nothing Canada can do about it. Your rambling argument is not particularly logical.",
        "label": "no"
    },
    {
        "text": "The article isn't about Zunera Ishaq, the niqab that covers the face and the Canadian citizenship ceremony. This article is about Ms. El-Alloul who was told she couldn't wear a hijab in a Quebec court room. The hijab covers the hair not the face.",
        "label": "no"
    },
    {
        "text": "I wonder how much energy commentators on the G&M website waste - having to constantly log back in when they have already clicked the box to keep them logged in, having to reload due to constant script failures, etc, etc, etc...................",
        "label": "no"
    },
    {
        "text": "\"have no feelings or sentiments on this election result.\" After all your lies and vitriol towards les Autres in the run up to it, I don't blame you for being in denial. Must be hard when so many Vrais Quebecoises seemingly ganged up against you.",
        "label": "no"
    },
    {
        "text": "IMO 'Ennui' is symptomatic of western society in general. People are losing hope in their governments at all levels. Governments no longer work for 'ALL' people. Fix this and people will once again become excited about a lot of things in their life.",
        "label": "no"
    },
    {
        "text": "how would you have got the extra staff to the airport? Or would you have hired them at outrageous extra $ per hours just in case? That would be fine when it was publicly owned but as a private company, you gots to max the profits for shareholders.",
        "label": "no"
    },
    {
        "text": "I don't think I'd be surprised at all Charlie! They are made easy for a reason. My response to John was simply to point out that an AED is a very important piece of equipment and not just 'anything'.So is 100% oxygen for that matter.......",
        "label": "no"
    },
    {
        "text": "Tammy, I still don't get the hysteria. The government can probably buy the system, or get it for free based on paying a small %age of the tolls back to the licensing company. As long as government sets the tolls, that's good business practice. C.",
        "label": "no"
    },
    {
        "text": "Lets get the G&M to sponsor a photo contest for all of Canada this spring, when the snow is all gone. Submit pictures of the roads and streets in a reservation or indian settlement you visit. the winner gets an autographed picture of chief Spence.",
        "label": "no"
    },
    {
        "text": "It means you can ask the values questions, but the person answering might be lying. (Which begs the question: So what do we do? Ask the questions while the would-be immigrant is strspped to a lie detector machine? Nice waste of resources).",
        "label": "no"
    },
    {
        "text": "Might it be that the appointments were appropriate, responsible and will contribute to well to the advancement of the nation's interests? This piece reads like the kind of partisan axe grinding indulged in by only the most novice political hacks.",
        "label": "no"
    },
    {
        "text": "A 'Canadian' committing a crime in a FOREIGN land against another country. His Canadian rights end at the Canadian border and he is subject to the laws of the country he committed his crime in like Afghanistan. He should have been tried there!",
        "label": "no"
    },
    {
        "text": "cripp... the CPC represents, at best, the choice of 35% of Canadians, with the NDP and Liberals representing around 60%. Besides, don't you think government policy is more effective if all parties can get a first-hand view of the situation?",
        "label": "no"
    },
    {
        "text": "The American Alpine Club has created a Sherpa Support Fund that will raise funds to assist the families of the Sherpas who died. I encourage and challenge anyone who has climbed or tried to climb Everest to donate. Www. americanalpineclub.org",
        "label": "no"
    },
    {
        "text": "@ Joanie. No my dear, you are wrong. The professions discussed above are all members of OMERS. A provincially mandates retirement pension plan that has an MRA( mandatory retirement age) of 60 years old or 85 factor. Mr. Miller can not change that.",
        "label": "no"
    },
    {
        "text": "We need people who feel they have a stake in the country. Booker prize winner Yann Martel described Canada as a big comfortable hotel with people checking in and checking out. I don't want to pay my taxes to a hotel, I won't fight to defend a hotel.",
        "label": "no"
    },
    {
        "text": "Wrong! There is no argument about Bach's superiority and there is no argument about Thor and his mighty hammer. May Odin strike you for your blasphemy.(yes, I'm being facetious... well, except for the Bach part, greatest genius in human history)",
        "label": "no"
    },
    {
        "text": "Personally, I resent being mislabeled a xenophobe or islamophobe for having a rational aversion to being blown up in public places by radical islamists. Going forward, can we please start using the more accurate label 'radical islamophobia' ?",
        "label": "no"
    },
    {
        "text": "Quebec, together with every other province, big or small, has a veto over matters like Senate abolition or the composition of the SCC. It's found in section 41. In what section of the Constitution do you think this special Quebec veto is found?",
        "label": "no"
    },
    {
        "text": "Oh I see, Sharp. Though your claim is both wrong and irrelevant, using all caps REALLY DOES make the UN complicit it the Rwandan genocide. In that case, YOU ARE COMPLICIT in the genocide our government perpetrated against the First Nations of Canada.",
        "label": "no"
    },
    {
        "text": "Here is the address: Electoral Assistance Department of Political Affairs United Nations Secretariat New York, NY, 10017 United States of America Telephone: +1 212 963 8737 Facsimile: +1 212 963 2979 Who is going to start a petition/request?",
        "label": "no"
    },
    {
        "text": "Bar None the best brunch in Vancouver , every time I have first city guests in town we go to secret location for Brunch. The perfect location to entertain guests arriving from London, NYC, Paris . A Gem of a restaurant in a sea of average options.",
        "label": "no"
    },
    {
        "text": "I used to work for them. The OAG report barely scratches the surface, it's even worse than what is being reported. This organization is rotten through and through. The transfer from Health Canada was just a power play, nothing more, nothing less.",
        "label": "no"
    },
    {
        "text": "Simple solution. Eliminate sex/ gender in all sports .The winners will then be the best athletes in that sport. No gender testing necessary. This approach would be consistent with the women's liberation movement and their search for equality.",
        "label": "no"
    },
    {
        "text": "Chief Spence has a stock portfolio which incudes google, Pepsi and Exxon. What is that - Exxon - I thought natives were against oil companies ruining their lands? Whine about oil spills and pipelines but then invest in the oil company - interesting.",
        "label": "no"
    },
    {
        "text": "The FORD SUBWAY - SHEPPARD IS THE RIGHT SUBWAY, for Scarborough....IT IS THE ONLY SUBWAY .... THAT DOES NOT FEED THE YONGE/BLOOR PROBLEM. KEEP THE KENNEDY TRANSFER... and Kennedy Go is your Toronto Relief Line, or atleast a big part of the equation.",
        "label": "no"
    },
    {
        "text": "Are you serious? We are not talking about their salary. It's their moving expense! Then again, if you don't pay into tax pool, you wouldn't be so upset. Try working for a living for a change. Then you will know how the rest of us feel about this.",
        "label": "no"
    },
    {
        "text": "To all critics: consider the context and current economical situation. Do not compare Martin's rosy days and surpluses. They did occur during relatively good economic times. Moreover, some of this surpluses were at the expense of the provinces.",
        "label": "no"
    },
    {
        "text": "Good for you, Ed. Never thought I'd see us agree on anything. Now add some insulation to those houses that have to be heated, more use of ground-source heat pumps, etc. and we have a real picture of our environmental future, not Jeffrey's cave.",
        "label": "no"
    },
    {
        "text": "I agree with pretty much all you said, but Canada1 isn't wrong in the fact that the far-right going super racist is worse than the far left going super anti-racist. Regardless, as you mention, stigmatization into tribes doesn't help anyone.",
        "label": "no"
    },
    {
        "text": "Is there anything specific you would like to debate? I'm open to an exchange of ideas. Or would you prefer that I just respond to your insults of 'ignorant bigot' with mindless taunts of my own as a substitute to actually discussing issues?",
        "label": "no"
    },
    {
        "text": "Boys have played with pretend weapons since the beginning of history... with zero tolerance there would have been few boys in any class since the beginning of schools....I am more than certain that in Ancient Greece boys played with toy swords.",
        "label": "no"
    },
    {
        "text": "I read the column. Not one mention of what you claimed. The author spoke about a link between violence and environmental degradation (not one I believe) - nothing about executives or the PM being involved in their death. No crow in my dining plans.",
        "label": "no"
    },
    {
        "text": "This is a legal issue, not physics. Legal issues are decided by advocates making arguments, citing precedence and anticipating so far as is possible, on what issues or legal principles the court will factor most heavily in making a decision.",
        "label": "no"
    },
    {
        "text": ".jplondonJP, there are landscapers and then there are landscapers. My guy and his crew are excellent at what they do, he as well, has the intelligence of a toad. Obviously/intelligence wise, you have nothing in common with my landscaper. Cheers..",
        "label": "no"
    },
    {
        "text": "It's so sad that everyday, ordinary, self-identified, 'hard working' taxpayers are being subject to mild disruptions ... not really. I've seen 'hard working' taxpayers at work. Hard at work making excuses ... more the rule than the exception.",
        "label": "no"
    },
    {
        "text": "A Starbucks barista in Calgary earns $10/hr. A registered nurse in Calgary earns a median wage of $35/hr. Annual salaries based on experience and qualifications can reach $90k. By comparison the average salary of a lawyer in Canada is $71k.",
        "label": "no"
    },
    {
        "text": "Sure. A principled foreign policy involves Baird humping legs in Bahrain... Uhm it should stay in Canada but these guys have blown it because Harper/Baird haven't the ability to articulate a sophisticated view of the Arab/Israeli conflict.",
        "label": "no"
    },
    {
        "text": "It is all Harper's fault, everything is either Harper's fault or Harris's fault as the partisan Con hate shills will tell you, Liberals never are to blame as their sins are due to Harper Federally and Harris in Ontario. Nope, no partisanship there.",
        "label": "no"
    },
    {
        "text": "Every new innovation in teaching math is only to make teach math easier for the teacher, even if not necessarily more informative for the students. Going back to memorization and drill methods is more work for teachers, and thus forbidden as Rote.",
        "label": "no"
    },
    {
        "text": "Like, maybe, because governments can pay that off over generations, and so these are not liabilities that are relevant to the current generation? ...Government of the UK is still paying off war debt from the Seven Years' War, last I looked....",
        "label": "no"
    },
    {
        "text": "Trumpers still twisting themselves into knots to excuse their fearless leader's dreadful behaviour. They're more like a religious cult, say Jim Jones in Guyanna with his kool-aid, than responsible adults. They are the downside of democracy.",
        "label": "no"
    },
    {
        "text": "Harper's foreign policy is aligned with the republicans, which continues to use a cudgel with Iran (along with Israel), and this is strategically very stupid. As Harper will likely continue to cleave to Israel, the sooner he's gone, the better.",
        "label": "no"
    },
    {
        "text": "I am amazed that so few comments here relate to Trudeau's ability to understand foreign policy. With respect, that will continue to be a major shortcoming for him and Canada. The world is on the move and little Justin is caught flat-footed.",
        "label": "no"
    },
    {
        "text": "Canada doesn't afford a carbon tax until our competitors (US, Mexico ,Korea etc) enact similar ones. Simpson says we have been overweight on carbon, of course we have a low population in a very large cold weather country what else would we be ?",
        "label": "no"
    },
    {
        "text": "The point is not that 'honest mistakes' were made, but they lied by denying that they were responsible. Only after it becomes too obvious who was responsible do they 'fess up'. Aw, poor Consevatives all confused. Nice white wash by the way.",
        "label": "no"
    },
    {
        "text": "Shosh, you're using facts. These shrill shills not only don't want a debate based on facts, they can't even comprehend facts. They can't even remember the facts between the time they read the article and then hit their keyboard to comment.",
        "label": "no"
    },
    {
        "text": "Winehouse's fate has some educational value. Although since Ford doesn't seem to have learned anything from being around people who've been beaten, thrown off balconies, shot, jailed and/or imprisoned, maybe he's a particularly slow learner.",
        "label": "no"
    },
    {
        "text": "But the pay is much lower and government revenues are much lower. Your 'manufacturing' was based on autos and auto parts; and making stuff for the oil and gas industry. You stole auto jobs from the USA and now the work has gone home and to Mexico.",
        "label": "no"
    },
    {
        "text": "There are no 'Harper PC's'! Harper destroyed the PC party. How soon we forget!! And I don't agree that igniting a world war is 'the right track.' The point is to keep the war going so that the weapons industry makes a big profit. Check that out.",
        "label": "no"
    },
    {
        "text": "Are you taking antidepressants btw ? Over 10% of us are. What happens when that number climbs to 50% ? And then there are large numbers of us self medicating with booze, pot, meth, coke etc. Yep. We're a happy bunch alright ! Joy to the world !",
        "label": "no"
    },
    {
        "text": "Complete lack of respect for her constituency; That should be the headline. Did the voters choose her as someone to lead the NDP? She should resign, and then run in the by-election for the NDP. Of course we know the strength of her convictions.",
        "label": "no"
    },
    {
        "text": "chas 13 Even some of the 10 commandments are questionable --like \"Thou shall not covet ...\" This is thought control... supposedly from a sky fairy ? read some of the critiques of biblical teaching ... but you'd have to have an open mind for that.",
        "label": "no"
    },
    {
        "text": "'Ms. Byrne joined the Reform party as a teenager.' Poor, misguided, brain-washed, demented soul! Imagine spending those very impressionable years having your head filled with right-wing propaganda from the likes of Preston Manning and Stockwell Day!",
        "label": "no"
    },
    {
        "text": "Since the Brexit vote last June some 25 countries have come forward and expressed interest in doing a deal with the UK. Top of the list is a Trump-led US. No, G&M free trade is not in trouble where reliable, democratic, honest partners are willing.",
        "label": "no"
    },
    {
        "text": "Let the woman do what ever they want with their bodies, even rent their company and smiles... pro-choice for this one, but don't waste taxpayer dollars with stupid rules such as legal to sell illegal to buy, this legislation takes us nowhere.",
        "label": "no"
    },
    {
        "text": "Love people who really know what has been 'clearly meant'. Wonder what is your interpretation of the First Amendment that talks about 'the right of people peacefully to assemble'. Or, definition of 'people' changes based on your preferences?",
        "label": "no"
    },
    {
        "text": "The currency might change, but there's no way for Canada to prevent a putative new country from using our currency. They would not, of course, have any influence on Canadian monetary policy, which would remain the purview of the Bank of Canada.",
        "label": "no"
    },
    {
        "text": "The niqab is a global symbol of subjugation. Just because we live in a free society doesn't that fact. How many of these women who wear the niqab and profess it to be their choice are in truth pressured by their husbands and mosques to where it?",
        "label": "no"
    },
    {
        "text": "'Japan with FUKUSHIMA is killing us, several times that of Chernobyl.'That load of completely false anti-nuke drivel is a sure signature of someone who's been drinking the green Kool-aid way too long and whose opinion can safely be dismissed....",
        "label": "no"
    },
    {
        "text": "I thought we were dealing with facts and truths? The funny thing about these things is that they are both supported with evidence. Something you haven't felt necessary to provide. Does that get you a Misinformation merit badge in the Denier Cadets?",
        "label": "no"
    },
    {
        "text": "There is no amount of $$ alone that can solve this problem. Pouring more money into FN communities that have no means to support themselves is as fruitless as handing over an inheritance to someone who has never had to earn a living for themselves.",
        "label": "no"
    },
    {
        "text": "I think we can all assume that 'Peter M. Cox' is a close personal friend of Ms. Wente, or could be her agent, since he's scrolled down the comments to reply (feebly) to as many that are critical of her as he had time for. So facile, so obvious.",
        "label": "no"
    },
    {
        "text": "POGG! That's Peace, Order & Good Government. That's in our Constitution. It's what Canada is supposed to be all about. Harper has brought us War, Chaos & Bad Government. For that I will be voting for someone else. And he is the WORST PM EVER.",
        "label": "no"
    },
    {
        "text": "So you are complaining about human nature. Your argument seems to suppose that all the budget issues are the result of this self interest when the story shows that pretty much every voter has an element of self interest. So much for your argument.",
        "label": "no"
    },
    {
        "text": "Forgot this gem from Cole Porter:'If you'd be just so sweet, and only meet your fate, dearIt would be the great event of 1928, dear Let's misbehave'All in the interpretation, but it would seem 'date-rape' culture was ok in music in the '20s.",
        "label": "no"
    },
    {
        "text": "shiftless2 The example where the parents take charge might. That would probably have the same affect as denial. Incidentally, people commit suicide because they have issues that they are unable to resolve in their own minds where it really counts.",
        "label": "no"
    },
    {
        "text": "Harper meant Duffy could be the Senator from PEI and fit the PEI quota even though he lived in Ontario because he is from PEI and had a vacation home there but Harper did not mean he could make expense claims as if he were living in PEI in actuality",
        "label": "no"
    },
    {
        "text": ".Yes he did, and than the governments (US, UK, Russia and Canada) that make the decisions on the what, where, when and how sat on 'it', doing NOTHING) The UN does NOT make unilateral decisions, the nations that form the security council DO..",
        "label": "no"
    },
    {
        "text": "Trump may disappear from the media, but 45% of his followers live on to make a possible Clinton victory a real nightmare. Hillary will no longer be under Obama, and I can see a nervousbreakdown before the four year term and her 73rd birthday.",
        "label": "no"
    },
    {
        "text": "Ed op: My list includes all non-functional clothing. The whole concept of \"modesty\" is a Judaeo-Christian imposition and has no place in modern society. All clothing not necessary for warmth or protection from environmental hazards should be banned.",
        "label": "no"
    },
    {
        "text": "Patwant Singh: I see you must have reported my comments to you and the G&M have removed. You are obviously just s shill for Harper and his court. As for reporting comments you don't agree with, 'if you can't stand the heat stay out of the kitchen,",
        "label": "no"
    },
    {
        "text": "@RyanWhat are you talking about? Do you just make things up cause they sounds good. Chavez put his country in the sinkhole and left his citizens with no hope for the future, with poverty and inflation running rampant. Try and stick to the facts.",
        "label": "no"
    },
    {
        "text": "If the citizens of Toronto elect any one of the candidates named so far it will be a huge improvement over the disgraceful bum now occupying the office. Anything the incumbent says or does should be ignored. Vote for someone you can be proud of.",
        "label": "no"
    },
    {
        "text": "Really? The 'embargo' has prevented Cuba from manufacturing sanitary napkins and toothpaste? Does Cuba import from Russia? Do Russians use toothpaste and sanitary napkins? Come on, there's got to be a more reasonable response to the question.",
        "label": "no"
    },
    {
        "text": "Basically you are signing a contract of slavery in marriage then again when you stop taking the birth control pill. People are bullied into marriage by society run like a puppet for the Pope of the Vatican City. It's a morality play for the devil.",
        "label": "no"
    },
    {
        "text": "Personally, I think you hit the nail on the head. It is completely acceptable for a girl to dress like a boy, play sports and be a 'tom boy'. On the other hand, a boy who is interested in 'girlie' things is thought to be odd and immediately labeled.",
        "label": "no"
    },
    {
        "text": "We don't need a law until one doctor in the land gets caught selling gender selection abortion services. Knowing that the present comfort is just one extremist with a medical license away from turmoil should reasonably give pause for thought.",
        "label": "no"
    },
    {
        "text": "How dare you Mr. Yakabuski, belittle the very real concerns of people like me. Watching the erosion of democracy is a huge deal and I will not have you tell me to go have a mani-, a pedi, a shampoo and facial and I'll feel better in the morning.",
        "label": "no"
    },
    {
        "text": "Why are jihadists attacking so many times and killing so many innocent people in European countries and in so many other countries around the world? What is the mandate and the ultimate goal of the jihadists? Where are they getting their ideas from?",
        "label": "no"
    },
    {
        "text": "Naomi misquoted the case of the Iowa Dental AsstThe Asst was fired because the Dentist's wife thought she was too attractive to be working with her. It was either she goes, or divorce. The Dentist was simply 'blackmailed'. Woman vs woman issue",
        "label": "no"
    },
    {
        "text": "'airplanes and ocean shipping is not even addressed in this agreement' ; that's only because the end result has been agreed to... how we get there is up to us to decide and it should.. will have to include air, ocean and land transportation.",
        "label": "no"
    },
    {
        "text": "[.And I struggle to imagine a universe in which Nigel and BoJo are hardworking men of the people, rather than just a different brand of elitists themselves....] Heck, they're the worst kind of elitists: they're journalists who went into politics.",
        "label": "no"
    },
    {
        "text": "Like voters supporting Rob Ford while their TTC bus service was cut under his tenure. They loudly complained... and voted for him again. Thomas Frank's prescient polemic, 'What's The Matter with Kansas', now fully resonates across North America.",
        "label": "no"
    },
    {
        "text": "actually in every state in the US, one has to have a firearms license in order to buy a gun. No license is necessary to buy a car, only to drive one. However , in the US everyone has a right to both a drivers license and a firearms license.",
        "label": "no"
    },
    {
        "text": "They are funding themselves from taking control of oil fields and taxing the people they conquer. Recent reports told how they are starting to starve as the people they relied on to feed them have fled and are no longer a source of food and funds.",
        "label": "no"
    },
    {
        "text": "' . . . It only seemed inconceivable to him that one would purport to be a serious analyst of Canadian politics without mastering one of the two official languages . . .'Actually, I thing he has good command of both Canada's official languages.",
        "label": "no"
    },
    {
        "text": "You assume the alternative to pipelines is oil by rail run by incompetents. I assume we can do better than that. Oil by rail in uneconomic with today's oil prices. And if we have to leave some of it in the ground, we have to start somewhere.",
        "label": "no"
    },
    {
        "text": "The fact remains that the threat of terrorism in Canada and the likelihood of being attacked by a terrorist is so low it is obviously political theatre. Canadians who had a front row seat to George W Bush and Rumsfeld falling for the same trick.",
        "label": "no"
    },
    {
        "text": "What difference does it make if you're 'born here'? How about my neighbour who came here as a 6 month old or my spouse who immigrated as a two year old? Are they less Canadian than you? I would say no way, they aren't. They are all Canadians.",
        "label": "no"
    },
    {
        "text": "Trump likes to read the parable about The Snake. What people haven't understood is that Trump is the snake in the parable. ''Oh shut up, silly woman,' said the reptile with a grin. 'You knew damn well I was a snake before you took me in.''",
        "label": "no"
    },
    {
        "text": "I don't think you'll find much evidence that it 'kept their civilization alive.' And there are many, many silly things that humans have believed for a long time; that doesn't make them true or effective, and certainyl doesn't prove efficacy.",
        "label": "no"
    },
    {
        "text": "I always look forward to this journalists articles and reading the comments as her writings are always discredited, invalidated and refuted with actual facts and logic. It's entertaining but also alarming to realize the standard of journalism",
        "label": "no"
    },
    {
        "text": "Low skill private sector workers have been crushed in the last 2 decades. Public sector workers by comparison have done much better. The public sector has become the other 1%. The civil service pension funds control assets that dwarf the rich.",
        "label": "no"
    },
    {
        "text": "In today's age of 'Political Correctness' no opinions expressed by middle aged white males will be tolerated. All groups, except white males, are untouchable no matter what inanity they come out with. I know 'check your privlidge', well %$6& you.",
        "label": "no"
    },
    {
        "text": "No, Trump is not the problem, Trump is the consequence of a political system that flaunts the label 'government of the people, by the people, for the people' while governing on the principle 'government of the money, by the money, for the money.'",
        "label": "no"
    },
    {
        "text": "OK, that would explain why Canada's indigenous population seems to resist being nationalized, so to speak. Ironic, eh. Any solutions to that issue other than reserves for 'foreigners' or assimilation given the rejection of elitist multiculturalism?",
        "label": "no"
    },
    {
        "text": "Nice research rog2010. thanksIn other news.....I happened to notice in the appointments to the G&M Board of Directors MR. John Gass (no joke) of Suncor....I guess that's why they call it the 'corporate media'. Run for and by the Mega corporations.",
        "label": "no"
    },
    {
        "text": "Bill Davis legacy. An utter disgrace. Last time I was in a Catholic high school for a daughters basketball game I was astonished at the catholic propaganda on bulletin boards. Lots of pope images etc. But I guess I should not have been surprised .",
        "label": "no"
    },
    {
        "text": "This policy would not be crazy if the US was on board and as long as India, China and other countries lived up to the Paris Agreement commitments. Without the US, it's economic suicide for Canada and other countries will also jump off the bandwagon.",
        "label": "no"
    },
    {
        "text": "Attack ads on Trudeau: Asked what they liked about the ads, six per cent found them humorous or funny, six per cent thought they were truthful, four per cent felt they were informative and three per cent believed they showed Trudeau's inexperience.",
        "label": "no"
    },
    {
        "text": "<sigh> a simple, respectful solution: Guarantee access to on-demand euthanasia services by funding transportation to dedicated funded clinics staffed by willing practitioners, or by providing funded mobile in-home services. Everybody's happy.",
        "label": "no"
    },
    {
        "text": "How can you be unaware of the fact that Roof WAS part of a group. He gives explicit credit to the 'Council of Conservative Citizens' in exactly the same manner that other idiots give explicit credit to Al Qaeda or ISIS for their atrocities.",
        "label": "no"
    },
    {
        "text": "Not happy with the churches ongoing ownership claims on marriage (Alabama yesterday), the circumstances of how I manage my death ( news today ) and the never ending claims over morality. She now wants to stake a claim on conscience, the hubris.",
        "label": "no"
    },
    {
        "text": "> Ford on crack is a better mayor than Miller straight. I prefer Rob Ford drunk to Olivia Chow sober. The man lies to your face like you're a punk. He uses your support and loyalty like a hand towel, and you applaud. This, folks, is Ford Nation.",
        "label": "no"
    },
    {
        "text": "Having been born in the US but living in Canada for many years, and often traveling through the US, I can say with clear accuracy that Canada is an afterthought to most Americans. This is not a bad thing, unless you have an inferiority complex.",
        "label": "no"
    },
    {
        "text": "No we didn't. A fresh platform, new ideas. The same old same old would be austerity, for instance. Lots of new faces in among the seasoned veterans and an smart, tough, energetic, kind-hearted, optimistic leader who has proven himself truly worthy.",
        "label": "no"
    },
    {
        "text": "'Natives have a right to their own way of living, thinking and feeling...'Perhaps, but when this or that 'way of thinking' leaves them in poverty, brutality, and misery, they've no right to complain as if it were somehow the fault of the rest of us.",
        "label": "no"
    },
    {
        "text": "I used to think the WHO was a responsible organization. I used to think the Cancer Society actually wanted to cure cancer. I used to think there was no such thing as corruption. I used to think the Globe and Mail was a reputable newspaper.",
        "label": "no"
    },
    {
        "text": "let us not forget that a lot of people moved to Alberta from Ontario over the last 15 years. Unfortunately they brought with them that incurable mental disorder known as liberalism. Liberals will not rest until the entire country is infected.",
        "label": "no"
    },
    {
        "text": "Yes I heard about that result as well but it received little coverage. Note to Haygagan, this poll is different because it was commissioned by the UN ( they are a respected international organization based ) and there were 7 million respondents",
        "label": "no"
    },
    {
        "text": "carbon tax will not affect the rich they can afford to keep on using carbon the poor on the other hand must use less carbon tax means the poor people make the sacrifice to save the planet the rich just carry on as usual, carbon costs more, so what",
        "label": "no"
    },
    {
        "text": "Yuen Pao Woo came to the aid of Chinese purchasers driving up property prices in the lower mainland. Who woulda thunk it?Salaries are so low in the lower mainland because people are willing to take a premium in terms of lower salaries to live there.",
        "label": "no"
    },
    {
        "text": "Insightful post, Tim. I am right with you on your way of thinking. Jackyspratt: Public opinion alone does not make good public policy at all. Actual facts and data are necessary. Therefore, your 39% agree with immigration is almost meaningless.",
        "label": "no"
    },
    {
        "text": "Point a finger and demonize. Attack anyone who wants to talk before 'acting'.Straight out of the Republican Playbook. You know, I've heard that foreign governments are attempting to affect Canadian politics. What if it was just a foreign Party?",
        "label": "no"
    },
    {
        "text": "Rmiller, Michelle Obama could easily run in 2020. She has given the best speeches by far during the course of the current election campaign and is now widely regarded as a political superstar, Michelle could even be a part of the Clinton cabinet.",
        "label": "no"
    },
    {
        "text": "Glbalsoul, you need to research Agenda 21 (Sustainable Development) because that's the global geo-strategy you are so misinformed about. I'm willing to bet that your first instinct after this is that I'm a Harper supporter, right? Get informed!",
        "label": "no"
    },
    {
        "text": "Same could be said for London, Hong Kong, Singapore, and NYC. Problem is even those markets got ahead of themselves and have corrected in their history. Torontoians are getting pretty good at rationalizing. Same thinking went on in Vancouver.",
        "label": "no"
    },
    {
        "text": "\"Rockin' Rio\" - Notwithstanding my rambling observation on libraries, whether the copying of records is theft or not is obviously not my point. I was merely commenting on the aptness of the analogy. Also, I'm still waiting for your \"second of all.\"",
        "label": "no"
    },
    {
        "text": "You are a liberal Liar that is common with Liberals Chretien couldn't tell the truth Lied about the GSTMoney was not paid out of Harpers office had you listened to Question period & had your mouth shut & your ears open you would have heard that",
        "label": "no"
    },
    {
        "text": "Everybody knows that Eve Adams is toast and I'm surprised that the Liberals would risk placing her in a riding they know they won't win. The only thing that Ms Adams has going for her are her good looks and unfortunately that won't win elections.",
        "label": "no"
    },
    {
        "text": "Well, Gibson isn't a Liberal, is he ? And given the crying need to act on the state of the Senate - the need to justify its role in democratic government - unleashing a reactionary on the subject is surely not an attempt to clarify matters.",
        "label": "no"
    },
    {
        "text": "I think the government is well aware of the looming job shortage yet is still pumping up immigration and the temporary foreign worker program to suppress wage growth in the name of globalizing the labour market. Such a shame for Canadians.",
        "label": "no"
    },
    {
        "text": "How fast was money changed from country to country pre-Reagan era? If you wanted to move thousands of dollars you had to carry it or have a certified back draft. Not like today where you can click a mouse and transfers thousands across the world.",
        "label": "no"
    },
    {
        "text": "'Critical infrastructure'Northern Gateway, the Trans Mountain expansion and the LNG export terminals will be more a part of China & India's critical infrastructure than they will be Canada's. We take all the risks; they get many of the benefits.",
        "label": "no"
    },
    {
        "text": "Well that settles it. All those scientists are wrong and HTexmes knows the truth. Thanks for letting us know. Perhaps you could have spoken up sooner and saved us a lot of angst, but at least now we know that there's nothing to this CO2 thing.",
        "label": "no"
    },
    {
        "text": "Utter rubbish. Every barrel of oil that isn't produced here will be produced elsewhere with no regard for the environment. All of the steel Mills you greens drove out of the country have been replaced by dirtier Mills with no regulation in China....",
        "label": "no"
    },
    {
        "text": "I also find it despicable that they continue to have Investor Class Immigrants come into the country although everyone knows they are headed for Toronto or Vancouver. They just want the Cash but let the rest of Canada deal with the problems!",
        "label": "no"
    },
    {
        "text": "Except that there is nothing to show for that spending but some ads. The money isn't accounted for, which is a surprise I guess given the way conservatives waste money on $12 orange juice, makeup artists and helicopter trips to the cottage.",
        "label": "no"
    },
    {
        "text": "You're forgetting air pollution created by burning fossil fuels. The resulting air pollutants kill thousands and cause illness in many thousands more in North America. Reduce these and the impact can be quick and dramatic in improving health.",
        "label": "no"
    },
    {
        "text": "You have quite the reputation as a fathead on this site don't ya Billy. Hear you are livin in your pickup?'Common usage often refers to various forms of asphalt/bitumen as 'tar', such as at the La Brea Tar Pits''en.wikipedia.org/wiki/Asphalt'",
        "label": "no"
    },
    {
        "text": "Orwell is laughing from the other side of the veil of tears - as the stooges of the oligarchs implode within the propaganda cul-de sac. Exposed - exposed propaganda careerists - no more bonuses - no new plant for that lonely cubicle in he ll.",
        "label": "no"
    },
    {
        "text": "no i disagree, claiming his decisions were wrong just cause he supports trump is nonsense. yes he has no place bringing any such bias into court in a hat but that can not in any way be shown to say he doesnt make decisions based on the law.",
        "label": "no"
    },
    {
        "text": "Are you Bitter? Sorry... yeah I always thought that was a good idea. After all... the waste prduct of making electricity from Nuclear is heat. Duh? Meanwhile Alberta ruined lake Wabamun with 3 thermo electric plants burning coal. I don't get it>",
        "label": "no"
    },
    {
        "text": "Dear AlbertansYes, we feel your pain, and wish you well. Remember, misery never lasts for ever. This Easterner will never say ?let those western baaastards freeze in winter?. You are valuable to us in good times and bad. Get well soon. Best wishes.",
        "label": "no"
    },
    {
        "text": "Eisenhower was lining up to call it the 'military, industrial and academic, complex' TWF, ( I kid you not) but was dissuaded by advisers on the grounds that the academics would spend the rest of their lives pillorying not just Ike but the party.",
        "label": "no"
    },
    {
        "text": "The three monkeys at the Toronto zoo are watching the purse, see no evil, hear no evil, say no evil. We are going ..down , down, down in a burning ball of fireOntario is the pizza handout capital of Canada. Got a contract ,,,get free pizzas.",
        "label": "no"
    },
    {
        "text": "I see all the Stephen Harper climate deniers are out commenting today, having blocked out Harper's ten disastrous years in Ottawa and laughable defeat on October 19TH 2015 to none other than 'Nice Hair Doe', they found a new Donald Trump to admire.",
        "label": "no"
    },
    {
        "text": "\"union bosses\"? You mean democratically elected union leaders? The one who object to *their* bosses pretense that all economic activity is the result of a handfull of VERY IMPORTANT MEN? Who object to the bizarre notion that workers don't matter?",
        "label": "no"
    },
    {
        "text": "Sign me up! Does anyone know how to find the 'coalition of the willing'? No, this is not tongue-in-cheek. I really want to find a group of concerned Canadians advocating an overhaul in Canadian health care by looking at what other countries do well.",
        "label": "no"
    },
    {
        "text": "one thing I will remember about Steve Poutine and this subject: when he said that ndp 'supported' hitler and of course vicious attack adds smearing opponents. I cannot imagine respecting anybody among robo call crew. sad story about Canada",
        "label": "no"
    },
    {
        "text": "I make the sacrifice everyday I come home from the mall empty handed. But it is not sacrifice to buy Canadian made goods or comparable goods... that is a blessing... quality, ethics, and they last so long there is value... so a hypocrite I am not...",
        "label": "no"
    },
    {
        "text": "I'm not sure the example of the Prophet - a man who lead his people to war to enforce his new religion, and who was married to multiple wives, including a child of 9 or 10 - is really the example we want to put forward for modern Islam, is it?",
        "label": "no"
    },
    {
        "text": "Only a poorly-educated immigrant from Scotland would use \"luddite\" in this instance. Obviously, you are not educated enough to understand the word. Not that I'm surprised. You are a well-known blusterer and blubberer. Hopefully, you are also old.",
        "label": "no"
    },
    {
        "text": "So why is it getting so hard to purchase a firearm these days? And proposing an Amendment would just be the most blatant of actions. Obama AND Clinton have raised all sorts of 'new' regulations that make it more difficult to obtain a weapon.",
        "label": "no"
    },
    {
        "text": "Why can't boys like the colours pink and purple without feeling they must be gender dysphoric? Why can't girls like trucks and climbing trees without being slapped with 'tom boy' labels? Who not let kids be kids and stop stereotyping behavior?",
        "label": "no"
    },
    {
        "text": "'in the UK the parliamentary party has a direct say in the leadership selection and removal process' ......... Would they ever have the nerve to try that with the majestic one? To even suggest a new 'family' to reign would be considered treason!",
        "label": "no"
    },
    {
        "text": "After trying to ethnically cleanse Bosnia, the Serbs turned their attention to Kosovo. Can't see the similarity with Crimea here. The US illegally invaded Iraq under a dubious rationale. That, I agree, is similar to what Russia has done in Crimea.",
        "label": "no"
    },
    {
        "text": "'But many detailed economic studies show that steep emission cuts needn?t lead to broad calamity; in fact, over time they could stimulate new growth.'Like Ontario's 'Green Energy' plan? The only growth it stimulated was the in your electricity bill.",
        "label": "no"
    },
    {
        "text": "The opposition to the pipelines would move to opposing a refinery and would use all the same arguments except for pipeline spills. None of the opponents talk about the 1,000,0000 barrel crude oil tankers arriving in Quebec every week of the year.",
        "label": "no"
    },
    {
        "text": "I'm not Conservative, but I don't see Tory as a loser. He was right that Ontario's funding of Catholic schools is wrong, but his solution to fixing the problem (public funding for all schools) was wrong, and so wrong that I would not vote for him.",
        "label": "no"
    },
    {
        "text": "Perhaps next Remembrance DAy, you will take an extra moment to be thankful for all that you do have. There are many countries that would have you imprisoned or even executed for your views. So, do you want to change Canada to something else?",
        "label": "no"
    },
    {
        "text": "Taking troops out of Iraq enabled the rise of ISIL. Having chitchat with the Castro murderers is sick. Arms deal with Iran will result in the nutty ayatollahs having nuclear weapons. I think it was for the best that he did not do anything more...",
        "label": "no"
    },
    {
        "text": "Remember when the Globe and Mail supported Saddam Hussein in his war against the Kurds? The Globe portrayed them as terrorists. Now all of a sudden they are the good guys. Here is a bold statement: in the middle east, there are no \"good guys.\"",
        "label": "no"
    },
    {
        "text": "How about making a nice profit by charging people to deliver mail to their house including the super mailbox people. Give them an option. Now that's an idea but we always sink to the lowest common denominator, just the same way we do in health care.",
        "label": "no"
    },
    {
        "text": "TOMy employment deals with these issues. The issues re compliance of US citizens are not new - but this law is. If you think stopping tax havens is a witch hunt. You are so wrong. It is huge. Just not on Canadians radar yet. www.tackletaxhavens.com/",
        "label": "no"
    },
    {
        "text": "To Michele Strategic voting means you know and admit you cannot win by non-strategic voting do we want Liberal and NDP MP's who have no confidence ? who know that they were not really the people's first choice STRATEGIC VOTING is for losers",
        "label": "no"
    },
    {
        "text": "Pierre Trudeau was a highly intellectual man, but he was also a public actor. Pierre Trudeau was brilliant. His intelligence, passion/compassion and integrity were never questioned. Let's see what his son/Justin is made of.So far so good............",
        "label": "no"
    },
    {
        "text": "Passionate as they are, I think these guys are the cure for Western pusillanimity. I think they should go over there themselves and handle all this personally. God speed and maybe, while you're over there, maintain radio silence, just for safety.",
        "label": "no"
    },
    {
        "text": "'The bylaw was never enforced but the city posted warning signs in response after losing a second lawsuit, in which a local lawyer was awarded more than $900,000 after suffering a spinal injury while sledding at a city reservoir.'That figures.",
        "label": "no"
    },
    {
        "text": "this is 3 and counting for really really good G&M editorials. What's the deal!? Keep making sense (apologies to David Byrne). This country really needs to hear from the media in whatever form that this harper hysteria is wrong wrong wrong!!",
        "label": "no"
    },
    {
        "text": "Not the way it works, kid -- experience shows that 'responsible people' in anger or panic do indeed shoot innocent ones on a regular basis. The stats are available from that paragon of firearms to the south, though you won't dare look them up.",
        "label": "no"
    },
    {
        "text": "Someday Lorna is going to tell us how important Christians among us - yes, even our most eminent churchgoing government leaders - practice the ethics and moral purpose that they take from the good book. But I will not hold my breath in the interval.",
        "label": "no"
    },
    {
        "text": "And here's SCLEB with more than 70 'thumbs up' readers - in spite of all the reasonable, fair, critical postings of people apparently unlike him/her self in this repository of Tory opinion. Honest Steve is counting on you SCLEB, whoever you are.",
        "label": "no"
    },
    {
        "text": "Ask a minor hockey or soccer coach what kind of input to expect from 'concerned' parents. Even the current system is better than a dictatorship of the loudest parents, the most fanatical parents, and the parents with the most time on their hands.",
        "label": "no"
    },
    {
        "text": "Not to mention free living and therefore the ability to bank > $200K/yr as savings. Oh, I forgot he needs a huge pension. After all, think of the huge income (as a snow boarder and drama teacher) he abandoned to serve us as PM. What a guy.",
        "label": "no"
    },
    {
        "text": "I hope you're right but as long as there is a core of 20-25% or so who would vote for independence in a heartbeat there is still the potential for some 'incident', innocent or deliberately manufactured to bring that 20-25% up close to 50% or more.",
        "label": "no"
    },
    {
        "text": "These reporters need to educate themselves. The Indians no longer use chief wahoo as a logo. Do they also have a problem with the notre dame fighting Irish? Minnesota Vikings? A leprechaun as a lucky charms mascot? Stop being so sensitive.",
        "label": "no"
    },
    {
        "text": "Again and to the low information crowd, Chretien wanted to join the war in Iraq but the Americans did not want Canada to join. Only after being rebuffed by the Americans did Chretien come out against the war. Sorry folks but facts are facts.",
        "label": "no"
    },
    {
        "text": "Of course his second thoughts he's keeping to himself as he is what's excellent about the column. A nothing contribution from a typical Konrad fanboy who can't articulate why he's thrilled. It's like giving a student an A without reading the essay.",
        "label": "no"
    },
    {
        "text": "My thoughts exactly. My daughter has celiac - not a laughing matter. Every time someone makes a joke regarding gluten, it just makes it that much easier for restaurants to ignore the problem and put it down to a life style choice - it isn't!",
        "label": "no"
    },
    {
        "text": "barjona: The Democrats and Hilary Clinton adopted Sanders position on post-secondary education. That was part of the negotiation that Sanders did to ensure some of his ideas were in the platform in exchange for him endorsing Hilary Clinton.",
        "label": "no"
    },
    {
        "text": "Thanks for those links Ed. I had no idea that my taxes were helping to fund this program. How stupid are Canadians on this issue? How much crap will Harper feed us before the country is broke? What is the position of Justin Trudeau on this issue?",
        "label": "no"
    },
    {
        "text": "There is nothing slippery about it, it's about time that this has come to light and going the right way, enough with the moral garbage, if ones feels it's immoral then suffer to the end but don't tell me that I should not have the right to choose.",
        "label": "no"
    },
    {
        "text": "In B.C. WCB (Workers Compensation Board cases) are routinely expedited to the extent that they make use of private clinics for treatment and surgery as that is faster than waiting in the public system. No investigation and punishment happening here.",
        "label": "no"
    },
    {
        "text": "'Mary Triny Mena is the 2012-13 Scotiabank/CJFE Journalism Fellow.'Right. And after reading your objective report, telling the world what Chavez did for the poorest people, I can understand why you were anointed by Scotiabank for a fellowship.",
        "label": "no"
    },
    {
        "text": "Nice article, yet not one mention of Beverley McLachlin's recent comments? When the chief Justice of the Supreme Court accuses their opponent of historic cultural genocide, First Nations can be forgiven for thinking they got this one in the bag.",
        "label": "no"
    },
    {
        "text": "Hey argyle5663, Yes they need to examine the reasons but more importantly, they must examine themselves and they reason they are attracted to this unconscious abusive behaviour. Until they change, we will not tolerate them doing this to us again.",
        "label": "no"
    },
    {
        "text": "There is a point to this, one would hope. Or are you fact-plucking to bolster some dark view of the world that you may harbour ? To the point, how many women in Sweden were raped by white caucasians ?Otherwise you're amongst the Trump party.",
        "label": "no"
    },
    {
        "text": "Actually, Mr. DC, like most people, after the women's public interviews, I was wondering what on Earth Ghomeshi's defense was to be. I did not realize that the interviews left out a lot of information, and included some that simply was not true.",
        "label": "no"
    },
    {
        "text": "You say Canadians do not support the bombing missions because there are no boots on the ground and finish with Iran has boots on the ground. So, boots are on the ground and your rationale to not support the bombing missions is out the window.",
        "label": "no"
    },
    {
        "text": "Glenn, thanks for your comment, a terrific addition had this been a popularity contest. Unfortunately it was instead an analysis aimed at determining why Canadians have less interest in their nation's first steps than Americans have in theirs.",
        "label": "no"
    },
    {
        "text": "I see your point about 'indiscriminately killing.' She makes it sound like the airstrikes have no specific target and are just bombing. The truth is that specific airstrikes may cause civilian casualties, but that's not indiscriminate killing.",
        "label": "no"
    },
    {
        "text": "Who wants a nuclear deal with Iran when the military-industrial-security-banker-government-religion complex would profit immensely by a war on Iran and Artillery Hillary is waiting in the wings to become commander-in-chief with her very own war?",
        "label": "no"
    },
    {
        "text": "No Margaret, it's not 'Teachers' unions are obsolete'. It's 'Margaret Wente SAYS unions are obsolete'. Big difference. Speaking as an oracle doesn't make you be one. This pontificating won't make you the pontiff of journalism. Get off your pedestal.",
        "label": "no"
    },
    {
        "text": "Even buildings get old and unsuitable for use. I have an admiration for history, but realize that current imes require a change for those working or using this building. No problems with turning a page in history, no matter my fondness for it.",
        "label": "no"
    },
    {
        "text": "Interesting reasoning. No doubt you feel we should apply it in cases of human suffering as well. When disasters strike, when famines hit, when wars are afoot... if there's too many victims to treat them all humanely, we should euthanize them. Right?",
        "label": "no"
    },
    {
        "text": "If we are really concerned about the equality of women in this country, then we would be far more upset and concerned about a thousand aboriginal women being murdered and missing, that we would be about a few hundred women wearing a face covering!",
        "label": "no"
    },
    {
        "text": "'Farmers get some $6 billion to $8 billion in welfare every year.'Do you have a source for this ridiculous claim? There are only about 200, 000 farms left in Canada. You are claiming that they average about $30,000 to $40,000 in 'welfare' each year?",
        "label": "no"
    },
    {
        "text": "So unless something is cancer it can't be studied? If it doesn't kill, it doesn't belong in a University course? No one is arguing that porn is the same as cancer or has the same effects. Very few things do. Does that mean they shouldn't be studied?",
        "label": "no"
    },
    {
        "text": "Canadians are the experts in identity issues. For decades we didn't know if we were Canadians or British. Then millions of us didn't know if they wanted to be Canadians or Quebecers. Now we're not sure if we want to be Canadians or Americans.",
        "label": "no"
    },
    {
        "text": "Oh for goodness sakes. When you hear a Quebecer saying they want to protect their culture what they are really saying is they want the scales of prosperity and economic benefits tipped to balance out in their favor. Nothing more or nothing less.",
        "label": "no"
    },
    {
        "text": "Why have men at all? Who needs them? Thx MW. Stick for us boys. We are a battered group. If you pay a bit of attention to modern advertising and sitcoms, you will notice it is almost always the wife who is the smart one and the husband is the idiot.",
        "label": "no"
    },
    {
        "text": "You were doing pretty well until the fairy tale about the US. I would assert that all parties have a range of opinions represented within them and it is a bit odd to pretend that there exists the possibility of a completely homogeneous party.",
        "label": "no"
    },
    {
        "text": "From that type of reply, one can only deduce that you must support totalitarianism as you have not explicitly condemned it. Your arguments, if you can call them that, are becoming ever more desperate. And I'm sure you'll throw that one back at me.",
        "label": "no"
    },
    {
        "text": "Re: apologise not apologize in a comment of yours below. The correct spelling of apologize is actually apologise in the UK. Canada has Americanized its spelling, as it has done with many of our words. Either is acceptable, as is realise, etc.",
        "label": "no"
    },
    {
        "text": "Gotta agree - all of a sudden the media discovered (invented?) a new racial sub-group 'White-Hispanic'. If Zimmerman had just been 'Hispanic' this would never have made the front page of the paper let alone seen Obama and Holder join the fray.",
        "label": "no"
    },
    {
        "text": "Hopefully the Bolivarian Revolution of Hugo Chavez will be embraced by even more Venezuelans, institutionalized in their Constitution and maintained forever. Hugo Chavez' positive role in History is assured. Long Live the Revolution!& BDS 'Israel'.",
        "label": "no"
    },
    {
        "text": "Bob, the argument isn't complicated: 1. Provincial Upper Houses served no sufficient purpose and were abolished. And weren't missed. 2. The Federal Uppper House serves no sufficient purpose and should also be abolished. It won't be missed.",
        "label": "no"
    },
    {
        "text": "Well, let the humour columnists do the same thing frankphi was talking about... only with words. It has nothing to do with creating chaos in a crowded theatre and everything to do with REAL media freedom and not cow towing to political correctoids.",
        "label": "no"
    },
    {
        "text": "If you believe in Jesus and live with that belief, you will find that you have a perfect peace continuously regardless of what life throws at you and that you enjoy living every day with a joy which cannot be described. You should try it some time.",
        "label": "no"
    },
    {
        "text": "Can we stop pretending that Michael Chan was singled out for any other reason than being Chinese. Even if he wasn't a successful minister, CSIS would still be suspicious and question his loyalty to Canada. They see his face and they see an enemy.",
        "label": "no"
    },
    {
        "text": "The original post is a comment doing violence to the poetry of the greatest of English writers, twisting the line to become a hollow sexist remark, and yet enough people have given it a thumbs up to 'score' in the positives. This is so wrong.",
        "label": "no"
    },
    {
        "text": "At one time I actually considered doing my master's at McGill... and would have had to deal with this idiot. Thank goodness I came to my senses and chose and American school. BTW you guys ever get your medical school accreditation back? lol",
        "label": "no"
    },
    {
        "text": "ERLady, Schmeiser was found guilty of stealing Monsanto's technology and forced to pay $15/acres for the 1,090 acres of GM canola he had growing. Schmeiser bought the seed from his neighbour and lied about it. He is nothing but a common thief.",
        "label": "no"
    },
    {
        "text": "Indeed. And all of the claims of \"the people\" voting him in ... this was a 50/50 tossup. only 50% of \"the people\" got what they want. The USA is still a deeply, deeply divided country. The biggest casualty is the environment. Michelle 2020!!",
        "label": "no"
    },
    {
        "text": "The further to the ' Left' a country or province votes the greater the disaster... look at France. Why is it that so many electorates, when unhappy and facing adversity, vote for the 'sounds good Leftists' only to find their miseries compounded.",
        "label": "no"
    },
    {
        "text": "Steal billions of OUR $$$ for back door buddies within Health Ministry, buying votes with gas pant moves, and on and on THEN ask for OUR $$$ again to bail US out! What's wrong with this picture Kathleen???????You can only play 'dumb' for so long!",
        "label": "no"
    },
    {
        "text": "Really?????He is more successful and accomplished more in his tenure then you will ever do with your life. I guess writing comments from behind a computer screen is an accomplished career for you. If anyone is a moron it's you. Look at your life!!!!!",
        "label": "no"
    },
    {
        "text": "I have studied the issue, as much as a layperson can. There is enough credible dissent out there to give me pause. There is no comfort or displeasure to be found in reaching a conclusion different than your own: just a little healthy skepticism.",
        "label": "no"
    },
    {
        "text": "If you don't have a broker, you can't buy stocks and if you blindly buy things without understanding how the stock market works or doing any research on the individual stocks you're buying, you will lose money and it will be entirely your fault.",
        "label": "no"
    },
    {
        "text": "And Obama just gave Assad's biggest supplier (Iran) carte blanche by suspending sanctions and letting them get away with their nuclear program. Obama has been useless as President. Hopefully an actual adult taking over in January will help.",
        "label": "no"
    },
    {
        "text": "There is a deep seated fear of losing one's culture and identity to immigrants from a completely different background. Ask Canadians if the are ok with Canada following Sharia law. Secularism must prevail to have a sustainable pluralistic society.",
        "label": "no"
    },
    {
        "text": "So, let's see, the authors of this unique endorsement (probably in the history of endorsements) were at the Rob & Doug Ford Party for Harper - they partook of the refreshments the Fords offered - and then they remembered they had a deadline.",
        "label": "no"
    },
    {
        "text": "There are peaceful ways to tackle an invading army by making things as much of a headache for them as is peacefully possible. Had we not waged WW1 we may not have had to wage WW2 as there would have been no national pride issue for the Germans.",
        "label": "no"
    },
    {
        "text": "A sad story, for the man, his family and the city. It is also taking the spotlight off policy and management where the conversation should be focussed. And on wether Toronto should be broken back into smaller units. I hope Rob Ford gets it together.",
        "label": "no"
    },
    {
        "text": "Given the widespread abuse against journalists, why is no one asking about other potential targets? And what standards are local and provincial police following? Canadians want their rights back in every sector. not just on the federal level.",
        "label": "no"
    },
    {
        "text": "C'mon, Jimbo, Let's not confuse rhetoric with facts. Canada's combined Provincial + Federal Debt to GDP ratio is at 53.5% (according to Kevin Page, last September). Greece is around 180%. Crucial to get under wraps, but hyperbole helps no one. C.",
        "label": "no"
    },
    {
        "text": "The simplistic and discredited worldview that will be shattered and not put back together again is the narrow, self-centered, self-absorbed, exclusionary, every-man-for himself social Darwinism of the preponderantly fundamentalist neo-cons...",
        "label": "no"
    },
    {
        "text": "if parliament could enact legislation to do it wouldn't that also have been politics? isn't anything politicians do called politics. actually now it is more about leadership and consensus building, something the country used to do before Harperland.",
        "label": "no"
    },
    {
        "text": "The late Joe Bageant said outright, many years ago, that yes, Globalization had 'something to do with the demise of factory employment.'He put it in more pungent terms, explaining the phenom in Deer Hunting With Jesus, Rainbow Pie, and other works.",
        "label": "no"
    },
    {
        "text": "Your Paranoia strikes deep. Free Press. If things had become so bad, the world media would've been pouring in and out for years wondering how that sweet nation of Canada could become so horrible so fast. Relax. The end of the world is not-near.",
        "label": "no"
    },
    {
        "text": "Definitely Freddie, I have no idea why we allow career criminals to exist. In your 30's and your only job has been drug dealing? Off you go, you are of no benefit to society. It's big business for the government so they allow it to continue.",
        "label": "no"
    },
    {
        "text": "The truth is that our laws, values and morals are man-made or natural. Divine will is purely an imaginary concept. So the argument that religion entitles a person to be sexist, racist or bigoted is no longer (because we know better) acceptable.",
        "label": "no"
    },
    {
        "text": "Reading most of these letters shows, surprisingly to me, how racism pervades many people's psyche. I believe most of the racists who write here have never known any black people personally and are just spewing out hate because they know no better.",
        "label": "no"
    },
    {
        "text": "Better yet, read Andrew Coyne's post-mortem column in the NP today. Harper didn't hurt the ones who gave him a wide berth, we're good. Relieved, but good. He's hurt the ones who supported him most, poisoning the Conservative brand for years to come.",
        "label": "no"
    },
    {
        "text": "I dunno. Just because you 'apply' for a job doesn't mean you'll get it. And if you are 'pushy' about it sometimes you end up being 'pushed out the door'. There's a fine line between being 'assertive' and being 'a pain-in-the-you-know-what'.",
        "label": "no"
    },
    {
        "text": "The government contributes more to my pension plan because I'm female? Wow, that's fantastic!! How did I go all these years without anyone telling me that I was finally going to cash in on my gender at retirement. Woohoo, great news ladies!",
        "label": "no"
    },
    {
        "text": "The F-35 cannot be detected at long range. it has a powerful IRST (infrared search and track) system that can detect approaching aircraft. They will be fine in a defensive. role in our arctic. The US and Norway will be using them for arctic patrols.",
        "label": "no"
    },
    {
        "text": "'submit the vice is political class in general. Should he become President how could United States be worse off than Canada. A proven business person vs a drama teacher.'Is there a sentence in there somewhere? Meaningless drivel is what I read.",
        "label": "no"
    },
    {
        "text": "Umm, I meant in the future -- you know, like under this current Liberal government. That should have been suggested to you by my use of the word \"will\" in my post -- which denotes the future tense. I can't believe I have to point this out to you.",
        "label": "no"
    },
    {
        "text": "@Norm and Observer12 So you guys think a father would leave his family in a war zone while he goes to setup a life in another country? Heck of a father who'd do that.... You're viewing refugees as being the same as economic migrants, they're not.",
        "label": "no"
    },
    {
        "text": "First of all they are still alive. Second, it's pretty easy to compare the health of siblings when there are 5 to 15 of them! In those large families, a couple might have gotten breast milk and the others formula or juice when lactose intolerant.",
        "label": "no"
    },
    {
        "text": "Why would the Greens of Brandon-Souris want to vote Liberal? What did Chretien and Martin do for the environment except talk. Sadly, weather events are on the side of the Greens; they will be vindicated; hope it is not too late for civilization.",
        "label": "no"
    },
    {
        "text": "Of course it matters hifiman. If a substantial number of the media (both workers and management) were Orthodox Muslims - would you not be concerned? And the number is know - just read some Chomsky, or look it up yourself. It's not hard to find.",
        "label": "no"
    },
    {
        "text": "Well done Chris. I normally disagree with your food analogy but in this review you hit it nail on. Not only with your style of writing, which is particularly good here, but with the content. Reminds me of Frank Bruni's reviews. To the point!",
        "label": "no"
    },
    {
        "text": "Automobile transportation is hugely subsidized - way more than transit. It is probabl the bigggest social program in Canada. Sure, driving is expensive, but a big portion of the road network is still paid by general taxes. How fair is that?",
        "label": "no"
    },
    {
        "text": "In only the very best of us does reason prevail over emotion. I know i strive, but too often succumb to emotion's sway. It's the far more common state for rationality to be obscured by our emotions. Only the most disciplined of humans can avoid.",
        "label": "no"
    },
    {
        "text": "I really dont think that the quebec voters were that organized. they fell in love with Jack Layton and voted for him. Jack is gone and Mulcair, while an able parliamentarian, just does not have the charisma to hold onto the gains that Layton made.",
        "label": "no"
    },
    {
        "text": "I find the biggest war is the war on truth as exhibited in all our National newspapers. Try this statement:'Obviously had I known, I would never have allowed this.'Ha! Ha Ha HAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA!",
        "label": "no"
    },
    {
        "text": "Thank you Globe. It is nice to see that somebody is willing to point out the difference between the 2 very distinct roles that the Professor did hold. It would appear that the learned professor was unable to make this distinction for himself.",
        "label": "no"
    },
    {
        "text": "Don't worry. Like Canada, Britain is a branch plant of the American-dominated corporate empire. The Americans will take care of the elites, the masses of people not so much. But the masses always suffer no matter what form of government is in power.",
        "label": "no"
    },
    {
        "text": "PSA tests on Ontario are not covered by OHIP. Just another form of discrimination against men. Perhaps ....in the name of equality... there should be a fee for mammography and Pap tests to the same tune as men shell out for their PSA testing.",
        "label": "no"
    },
    {
        "text": "joannie. wGive specifics. You can't just decide to change the rules because you disagree with the results. Arbitrators are supposed to be neutral. After reading the decision (which you should), as I far as I can tell, this decision was balanced.",
        "label": "no"
    },
    {
        "text": "A boy for oil and a girl to spoil... supported by a generous government shopping for votes on the backs of those that need as much support but certainly won't get it..That is a lot of take out for already wealthy lustily breeding/voting families.",
        "label": "no"
    },
    {
        "text": "Nobody is addressing the effects of Globalization & technology. Its a different world out there and too many both left & right have their heads up their a$$es not to acknowledge it. Its not a matter of left wing or right wing politics anymore.",
        "label": "no"
    },
    {
        "text": "One of the television reports about Howe's appearance in Saskatoon on Saturday said this would be his last public appearance. Given how dazed and disoriented he looked from the broadcast reports, I would agree with your comments wholeheartedly.",
        "label": "no"
    },
    {
        "text": "I'm not sure you spoke to the issue raised by \" Jack\". The first past the post system worked magic for the Liberals formed governments under Chretien. What is conceptually different now? And was it bad then ? And bad now ? Or good then and bad now?",
        "label": "no"
    },
    {
        "text": "Sorry, boys, I didn't realize my big words were scaring you so. Let me see if I can turn myself into a typical Harper supporter with this here ball-peen hammer: (thunk) (thunk) (thunk) (thunk) Nope, critical faculties still functioning. Ah, well. ;)",
        "label": "no"
    },
    {
        "text": "Sorry to disappoint Dieter and mbd: I do not have an english degree, nor am I a 'he'. I do have a BA in political science and psychology, as well as LLB (law). I spelled comrade wrong: through inadvertance, or recent bout with blindness. My bad.",
        "label": "no"
    },
    {
        "text": "a great example of aging gracefully, this summer my wife and i went to Europe for 3 weeks normally would put if off but we are almost empty nesters- we had a great time and many weeks later and we are still bathing in the glow of a glorious trip.",
        "label": "no"
    },
    {
        "text": "Its just ignorant to suggest Harper is an intellectual lightweight. Call him a cheater, a lier, bully as you wish, but there is no evidence to suggest he isn't relatively smart man. Trudeau on the other hand......the evidence just keeps piling up.",
        "label": "no"
    },
    {
        "text": "Excellent initiative. Among the many benefits of biking to work, under the right conditions, is the 'Joy of Transportation'. Many other cities, even those with colder climates, such as Montreal and Copenhagen, are also moving in this direction.",
        "label": "no"
    },
    {
        "text": "The fact that we have only had three referenda shows how unnecessary they are. How did we decide to give women the vote? How did we decide that First Nations people should be able to vote? How did we decide about provincial boundaries and rights?",
        "label": "no"
    },
    {
        "text": "The spouse with the lower income claims the benefit. So if one parent makes much less than the other, they get to claim it.BTW, if you don't like income tax rates in Ontario, there are jurisdictions in Canada with much lower income tax rates.",
        "label": "no"
    },
    {
        "text": "When I was a kid we had to hide our porn magazines. The internet has made everything so much more accessible. Not sure why the writer thinks kids aren't into porn regardless of a school sex-ed class, or the absence of one. Kinda naive of her.",
        "label": "no"
    },
    {
        "text": "That is part of the problem. But consider this: Indian Act was the foundation of reserves, elected chiefs and ' wards of the state'. What do you do to transition from dependence to independence and hwo lo9ng to build the necessary capacity?",
        "label": "no"
    },
    {
        "text": "Spin as you like. The undeniable fact is, Ontario has been \"transformed\" from a giver to a beggar after the 11-year ruthless abuse committed by the incompetent and yet very corrupted Liberals and Wynne is the worst of the worst, the rotten one.",
        "label": "no"
    },
    {
        "text": "Cry me a river. Rob Ford was a disgrace as mayor. Sad he's dead at 46, but it is a relief he is no longer on council. His type of poison deserves no tributes, although it is good that people are kind to his family during this time of grief.",
        "label": "no"
    },
    {
        "text": "Many parents would like choice in their children education. This needs to be part of whatever system is in place. One school board or one union should not control what public education is available, especially in area of higher poplation density.",
        "label": "no"
    },
    {
        "text": "there is of course a difference....as he explained in the interview at the time, if David Suzuki was able to, he actually would make it a crime for a democratically elected political leader to not take the actions he demands regarding global warming",
        "label": "no"
    },
    {
        "text": "Political Correctness run amok ! It's disgusting that the left parties and left media are not held accountable. We can fire politicians on the left by not voting back in office and we can fire left media by not buying their garbage they sell.",
        "label": "no"
    },
    {
        "text": "I learned two really important things from this article. 1) Convict leasing had the effect of extending slavery in America well into the 20th century. 2) The comments in this form demonstrate that Canada also has a long way to go in fighting racism.",
        "label": "no"
    },
    {
        "text": "Israel was not founded by European immigrants, it was founded by Jews (due to centuries of anti-Semitism). They didn't invade or impose their culture on anybody; they just went back to their homeland. Once again, you make a specious argument.",
        "label": "no"
    },
    {
        "text": "Excellent observations, Feather. The fact is that capitalism, love it or hate it, keeps pulling itself off the mat in the face of other systems. Like all would-be revolutionaries, the Adbusters gang likes to portray the world in apocalyptic terms.",
        "label": "no"
    },
    {
        "text": "That is why we keep getting updated flu shots, unlike Polio. They work, they are effective and the scientific and medical community has done us a huge favour by recognizing and keeping up with mutations. You don't ignore a problem you deal with it.",
        "label": "no"
    },
    {
        "text": "Good point. Maybe the solution is to eliminate taxes on income and apply them to consumption only. After all, rich people spend more. Create a threshold for low income people so that they are not paying more proportionate to their total income.",
        "label": "no"
    },
    {
        "text": "Mr Mulroney may have been a bit venal but he was a giant compared to the bunch in power now. He stood tall for Nelson Mandela and against apartheid while that weasel Stephen Harperfounded the Northern Foundation to oppose his fight against apartheid.",
        "label": "no"
    },
    {
        "text": "This is so funny I can't see where I am going to start. Try to relocate those popluation on EI anywhere in NA and see if they are more employable. Some are, but many aren't. Try to relocate physicians and see if they are employable. You bet.",
        "label": "no"
    },
    {
        "text": "James I hate to be the first to tell you, but Stevie's world is crashing down, and you are going to go down with it. We've had several years of the Economist's hand on on the till and all he's delivered is debt and unemployment to the middle class.",
        "label": "no"
    },
    {
        "text": "Unlikely as teachers (Education) and nurses (Health) are both provincial responsibilities. However, I've never seen any discussion about 'gender-balance' in either profession and don't ever expect to as women would not benefit from that discussion.",
        "label": "no"
    },
    {
        "text": "I dare the Left make this an ELECTION issue in October 2015 1. Kahdr 2. wearing the NIQAB in citizenship court 3. anti Terror bill I dare you The leftists on G and M online comments are NOT REPRESENTATIVE of the general population and they know it",
        "label": "no"
    },
    {
        "text": "Bravo Ms. Wente for prodding the internationalist puritans who see the cult of U.N. idolatry threatened by good old Canadian pragmatism. Canadian boots on the ground beat gab-fests and black-tie invitations and these people need to learn this.",
        "label": "no"
    },
    {
        "text": "CBC is an anachronism. So, too, are many private TV networks. So, too, are some print media outlets. Time ecomic and social circumstances will eventually take care of the last two. Unfortunately, that won't be true of the public funded CBC.",
        "label": "no"
    },
    {
        "text": "Good post. And you had to BE in Atlantic Canada to understand the visceral nature of the defeat.... it was exultant, everywhere, except in hardcore circles (assuming that of course, though many hardcores have said to me they knew they blew it).",
        "label": "no"
    },
    {
        "text": "At least Canada and Canadians aren't on Trump's personal hit list. The Trump family fortune started in Canada, after all. But if he reaches the White House and has Republican majorities in the House and Senate we could well get sideswiped.",
        "label": "no"
    },
    {
        "text": "'With all the shocks to Canada?s oil-and-gas industry, this country needs to export some of its energy from Alberta and Saskatchewan to tidewater and beyond.'So, that is the essence of the argument? Deep thoughts from the G&M editorial board.",
        "label": "no"
    },
    {
        "text": "We need real changes. A few ideas - people on the reserves need to be given the title to the their houses and incentivize people in remote reserves to move to the bigger population centres that have more services and opportunity for their children.",
        "label": "no"
    },
    {
        "text": "Lorna, what is your take on the story of the great deluge? In that scenario god euthanized most of the human race for being 'sinful'. Whether you consider it literal or allegorical it doesn't say much for the sanctity of human life by your creator.",
        "label": "no"
    },
    {
        "text": "When wrong is committed in the world, it is right to sanction it. As a Christian, I say it is high time that Christians stop defining themselves by what happens in the bed. It is time to define ourselves by our generosity to all of our fellow man.",
        "label": "no"
    },
    {
        "text": "Bravo, indeed! Line of the year, so far:'The Conservative government of Canada: tough on crime over $32,000'(I hope some opposition group will ask to borrow it around the time of the next election. Canadians have such short political memories.)",
        "label": "no"
    },
    {
        "text": "Putin is the best world leader going. He is the leader of Russia, not a bought puppet like Obama that takes his marching orders from foreign billionaires and special interest groups. I like Putin more than any politician on the Canadian scene.",
        "label": "no"
    },
    {
        "text": "You are making selective references to history. What is happening today is more like 1956 when Russian tanks were sent into Hungary. In 1956 the world was focused on Suez and did nothing. Today the world is focused on ISIS and doing nothing.",
        "label": "no"
    },
    {
        "text": "The Duffy trial may not really matter in the end because people that see what went on in the PMO, already would never vote for Harper. And then there are the Harper supporters who will vote for him no matter what he does. You can't fix stupid.",
        "label": "no"
    },
    {
        "text": "Nail on the head, rcalon. Dakota Whitecap here near Saskatoon removed themselves from the Indian Act. Totally independant and doing very well for themselves. Why? They live near a big city so they opened a casino. Can't do that at Attawapiskat",
        "label": "no"
    },
    {
        "text": "*Levin* Total frontier gibberish! Why don't you just say Canada instead of 'North of the 49th? Being as toronto is at 43.65?. And what does your statement have to do with what I posted? If you could stay on subject that would be great.. Cheers.",
        "label": "no"
    },
    {
        "text": "Make borrowing easy. Encourage unsafe levels of borrowing. Never heed the eventual payback. Finance economic growth by borrowingForce pensioners to borrow more than they can afford. I don't understand economics, this all sounds Greek to me.",
        "label": "no"
    },
    {
        "text": "Harper managed to put together what Mulroney destroyed, so Brian keeps popping his head out of corporate board meetings to fish for compliments in the most disgraceful way, although nothing can match the night of the brown bags for this envious man.",
        "label": "no"
    },
    {
        "text": "No, it isn't. I use my library both physically and the Overdrive app, so even though I'm not BUYING books, I'm still reading like crazy. Both of my kids are avid readers too, and even though they're teenagers, they neither of them like ebooks.",
        "label": "no"
    },
    {
        "text": "I believe that Bernie Sanders is the BEST candidate running for POTUS by far. And I don't completely understand why so many people keep regarding him as an extremist. He's a New Deal Democrat, and no more of a 'commie' than Eisenhower was!",
        "label": "no"
    },
    {
        "text": "Just curious, David - why is it that you think she's writing in the wrong newspaper? Granted, her twisted logic would be more at home over at Sun News, but I suspect you think she's somehow superior to this paper, when she is anything but.",
        "label": "no"
    },
    {
        "text": "Whenever I have to watch commercials at movies I think \"didn't I pay for the movie already?\" It's like having commercials in a paid online service. So tempting for the businesses running those businesses but so wrong from a consumer perspective.",
        "label": "no"
    },
    {
        "text": "Let's hope that the Liberals , by getting hit on the head by the 4 by 4 of reality, make some wise decisions... the ship of state was manouvered successfully through the global economic maelstrom by the previous government and now comes another.",
        "label": "no"
    },
    {
        "text": "aw chuckles, I googled \"David Suzuki eliminating fossil fuels\" and got not a single hit that was applicable. Lots of reducing though. I'm sure he must have used those words in the same sentence at some moment in time, just can't find any. Can you?",
        "label": "no"
    },
    {
        "text": "C1 : I see you didn't comment any further on chief spence being released after observation... I remember you saying my post that she was probably admitted for observation was simply not possible in today's' healthcare system... Apology accepted..",
        "label": "no"
    },
    {
        "text": "Canadians look at the UN through the same lens they were using in 1967. The world has changed. Look at the human rights council, there are at least a dozen countries on it that are known to be among the worst perpetrators of human rights violations.",
        "label": "no"
    },
    {
        "text": "It's funny how puritanism is now a thing of the left, too. ---------------------------NOW?it has always beenlook at Communist China with women in Mao suits dressed like menor any Communist countrycommunists are leftists right? not punning on 'right'",
        "label": "no"
    },
    {
        "text": "Once could probably defend the list and PM Harper's right to try to appoint a federal court judge. What is intolerable are his lies about the Chief Justice's conduct. His own conduct and that of the PMO should be enough for him to decide to resign.",
        "label": "no"
    },
    {
        "text": "17 million people voted to leave, according to Doug they are all xenophobes and racists and probably nazis. These smug arrogant mouthpieces really believe that everyone that does not fall into their brainwashed worldview is inferior to them.",
        "label": "no"
    },
    {
        "text": "There are male librarians; however, it is not a highly paid profession; it has become another female job ghetto. Dentistry is a much more lucrative profession. Glad to see there are as many women as men in the student population at Dalhousie.",
        "label": "no"
    },
    {
        "text": "So all those presentations he did to international audiences on the merits of carbon capture and how it important it is to our green future - he was just lying? He doesn't actually believe it matters? You have a very low opinion of him I see.",
        "label": "no"
    },
    {
        "text": "It appears you know little about the American system of government either. You probably are too young to remember the U.S. supreme court tossing the 2000 Presidential election to George Bush, who received 200, 000 less votes than his opponent.",
        "label": "no"
    },
    {
        "text": "'Trudeau?s Senate move is bold, but not in the spirit of reform'There is more than one way to reform the Senate. Mr. Trudeau's concept of reform seems easier and more easily achieved than the 'spirit of reform' as conceived by other parties.",
        "label": "no"
    },
    {
        "text": "james bezan now saw 'well, now, this is a 'non combat mission' (for canada)'.well wasn't that what we were told from the get-go?if it was a non combat mission when it was announced in 2014, making it a non combat-mission now is hardly a change.",
        "label": "no"
    },
    {
        "text": "Yakabuski accomplishes the near impossible and writes a column that makes me defend Rand Paul. How dare you accuse Paul of being paranoid while you defend secret spying on an entire nation. Just who is the paranoid one in this equation? What a joke.",
        "label": "no"
    },
    {
        "text": "You sound very much like someone who'd think anyone to the left of Vlad the Impaler is a far-left socialist. The Ontario Liberal party is not even remotely socialist, with their penchant for selling off and privatizing public assets and utilities.",
        "label": "no"
    },
    {
        "text": "R-W: no Lamont probably doesn't travel much, just like his co-Reformers.In the Reform party we have now, broadening your mind and visiting other countries are not exactly something they value. They'd rather stay home... hidding behind their shed.",
        "label": "no"
    },
    {
        "text": "'However Russia can afford to wait while Ukraine can not. Something will eventually give.'Not clear: Russia's economy is taking a duking from the sanctions and the like. And, sooner or later, at least some Russians may want to each cheese again.",
        "label": "no"
    },
    {
        "text": "Ontario is experiencing a massive void of leadership across all provincial parties - and in Toronto. We are all to be worried about massive government debt and a failing corporate sector but no one has a plan beyond securing their own future.",
        "label": "no"
    },
    {
        "text": "Simpson is on top of the environmental file, and has co-authored a book on the recent history of activity in that area - it's just that he isn't up to posting reasons for the growing need for proactive intervention. Not in a business publication.",
        "label": "no"
    },
    {
        "text": "sneakypete says I am taking Coyne OUT OF CONTEXT but does not explain we have just his word, not good enough so Pete Sneaky why don't you give us the Contest of Coyne don't be so lazy in a debate you have to make a case come on use your wits",
        "label": "no"
    },
    {
        "text": "I inherited it from many generations past, all of whom worked hard so their descendants would have a little easier life. Our descendants should expect the same, but what they'll be saddled with is a large federal debt with little to show for it.",
        "label": "no"
    },
    {
        "text": "Ted - you mean like what's been going on in California for the last 4 years - record drought and high temperatures? Yes, that has been wonderful for California's fruit and vegetable industries. Ask anyone in California - they all just love it.",
        "label": "no"
    },
    {
        "text": "A pointer for Liberal supporters. A reference to Harpo or to Nazis regarding the Prime Minister means that your comment goes into the electronic version of the oval filing basket. A least try to be adult here. This is not a children's magazine.",
        "label": "no"
    },
    {
        "text": "Shame shame shame on the taxpayer funded Harper/Ambrose trolls and their smearing of Hillary Clinton and for interfering in the US election. Shame shame shame on them all. Just more damage from the Harper years PM Trudeau will have to repair.",
        "label": "no"
    },
    {
        "text": "Joannie likes the 1700s. Back in the good old days when you were paid in coal and had a vacation day once a year. In her small mind, if one person has no benefits, nobody should have benefits. If one person is blind, lets poke everyone's eyes out.",
        "label": "no"
    },
    {
        "text": "Freedom of expression should not include allowing women to be repressed or supporting Islamic extremists. i wish I could reference an article in the G&M, written by two Muslim women as to why we should not support the wearing of the niqab.",
        "label": "no"
    },
    {
        "text": "You're right. This is an ecological analysis and one can also say that it's due to climate change that people are less likely to have a family doc. The authors clearly have an agenda-and that is to shunt money away from doctors and primary care.",
        "label": "no"
    },
    {
        "text": "Unfortunately you could change political parties and the result would be the same. The writer errs when he says the helicopter replacement went back to 2004. The original replacement was an EH 101 which was cancelled for political reasons.",
        "label": "no"
    },
    {
        "text": "Here is one of the problems with the Canadian voters- as of 8:35 MST this editorial on a serious issue with our democratic system has 69 comments... an article on whether or not Leafs coach Randy Carlyle has a job next year has got over 50 comments",
        "label": "no"
    },
    {
        "text": "Ask a Canadian combat soldier how enthused they are about 'peacekeeping'. Ask them how they like the government using them as social workers without the ability to defend themselves. They know how useless the task is as well as the proponents.",
        "label": "no"
    },
    {
        "text": "Slavery? was that that thing all over the world? As performed by such notables as the mongols, romans, assyrians, babylonians, chinese, ARABS, native canadians, incas, aztecs, did i mention the small role the arabs and the list goes on...spanish....",
        "label": "no"
    },
    {
        "text": "Student success in math and science is inversely proportional to the extent of overmanagement by outside consultants and political charterists made welcome by the min/ed. This infiltration has impugned the professionalism of front-line teachers.",
        "label": "no"
    },
    {
        "text": "..'blah blah blah, blah blah, blah blah blah blah blah. Blah blah, blah blah blah blah blah blah blah blah. Blah Blah Blah. blah blah, blah blah blah blah blah blah blah. Blah blah blah blah .....................................................",
        "label": "no"
    },
    {
        "text": "'Further they do not understand that by hating all Muslims they are responsible for the increase of 'lone wolfs' '---Don't count on this as a defense strategy in a murder trial. It works well in Social Engineering, but holds no legal water.",
        "label": "no"
    },
    {
        "text": "The dictators in the arab world were all mostly secular in nature and not a threat to the west. Some of them did have a problem with Israel and other countries in the Middle East but they were not lethal. Now what we have is a mess. Its so sad.",
        "label": "no"
    },
    {
        "text": "'Mr. Harper is not bringing back capital punishment. He?s doing worse. Condemning human beings to die in their cells like forgotten animals without the slightest trace of hope is a punishment more cruel than injecting them with lethal poison.'So?",
        "label": "no"
    },
    {
        "text": "Denglish - I've read a lot & rejected it. Since you appear to be unaware of the religious warrant for violence you might want to do some reading yourself. Google 'violence in the Bible' or 'violence in the Koran' - very enlightening and depressing.",
        "label": "no"
    },
    {
        "text": "And Canadian troops captured by Chinese during the Korean war?? look it up.Being a prisoner of war is just that, a prisoner, you are at the complete mercy of the victors. Ask any surviving member from Stalingrad... wait their aren't any left.",
        "label": "no"
    },
    {
        "text": "As the new format renders it virtually impossible to debate ideas, it appears that the G&M doesn't believe that is the site's legitimate role. We're just supposed to read the news that's published and believe it, I guess. Mao would be proud.",
        "label": "no"
    },
    {
        "text": "Sick days is a red herring. No one gets unlimited sick days. Most municipalities stopped paying out for sick days in the 80s and in the past few years more municipalities are cutting annual sick days in half and capping how many you can bank.",
        "label": "no"
    },
    {
        "text": "[The US needs a change and Donnie has the diaper full to do it. ] The US is in trouble, no doubt. But Trump is the kind of change you go for if you've got nothing left to lose. America has an awful lot left to lose, and Trump will lose it for them.",
        "label": "no"
    },
    {
        "text": "I smell envy and envy isn't a good enough reason to condemn billions of helpless children to the greenhouse gas ovens of an exaggerated crisis. Who's the fear mongering neocon again here? It's any excuse to hate hate hate Harper. Peace man!",
        "label": "no"
    },
    {
        "text": "According to a very close source, his wife, we learn Donald is a child minded grown up. Well, Donald go home and rest, you are fired. Who needs an erratic child running political future of USA? Nobody for sure. Immaturity is a disqualifyer indeed.",
        "label": "no"
    },
    {
        "text": "\"Canada began to move inexorably further and further to the right wing.\" This is what the conbots would like us to believe but it isn't so. It only appears to be that way because of our antiquated first past the post system of electing government.",
        "label": "no"
    },
    {
        "text": "@Salear: I fail to draw the connection between inspecting food preparation sites and spiking drinking water. It's not one in the same at all. I am free to chose for myself what my health decisions are. That's a liberty we are afforded in Canada.",
        "label": "no"
    },
    {
        "text": "Typical democracy hating elitist who doesn't want the people to have a voice in anything. Oh, but he'll take all the taxpayer money he can get his hands on. This character may have a bunch fancy academic titles, but he ain't nothing but a cockroach.",
        "label": "no"
    },
    {
        "text": "I think all that Newfoundland oil goes to other countries. It does not stay here. Since Canada does not actually get oil but sells the rights to that get that oil I believe the oil belongs to the oil companies and they can do what they want with it.",
        "label": "no"
    },
    {
        "text": "Not wanting to engage in a sexual act that is degrading, painful and completely asexual for women is not 'religious and moral'. But it may just be that women are not interested in gay male sexual practices. If you are, go for it, and tip up.",
        "label": "no"
    },
    {
        "text": "This was a very pertinent article. I think the G&M did something very important by investigating and reporting those suicides. However, the demagogic nature of the lengthy piece took away from the points that need to be raised in this context.",
        "label": "no"
    },
    {
        "text": "I'd like my children and grandchildren to have clean air and water, and not be subject to overwhelming climate change. We can do that if we stop with the 'drill baby drill' policy, and carefully use as much petroleum as we need, and not a drop more.",
        "label": "no"
    },
    {
        "text": "Can't we just focus on the most vulnerable for now? That would be the children and parents who support them. And among these family groups, let's focus on the ones at most risk due to ethnicity or religion. Gender bias and fear-mongering be damned.",
        "label": "no"
    },
    {
        "text": "I think 'pro-life' is a misnomer. I think the movement should call itself 'anti-abortion' or 'anti-choice', which is more accurate. The 'pro life' tag implies that a person cannot be pro choice and pro life at the same time, which is false.",
        "label": "no"
    },
    {
        "text": "no, this was in large part the work of a Mexican drug cartel. Check pbs. org for an excellent documentary on the deep level journalistic work done to track the meth epidemic in the USA. Fortunately this deadly scourge is not as prevalent today",
        "label": "no"
    },
    {
        "text": "Bob: I hear what you are saying, but trying to go into great detail on this topic with some of our settler friends is like casting pearls before swine. I leave you to continue the gentlemanly approach, while I undertake the barroom approach.",
        "label": "no"
    },
    {
        "text": "Richard Wright, you can answer you own question by go to Pubmed or search Google scholar and, search for things like chronic effects of mold, chronic effects of smoking cannabis etc to find out some of the long term effects of smoking cannabis.",
        "label": "no"
    },
    {
        "text": "I've never trusted computers anyway. I don't pay any bills online, or put any personal information online. It's scary enough that much of my personal info is already on line through my bank, my doctor, my dentist, my employer and my creditors.",
        "label": "no"
    },
    {
        "text": "Oh, he's a racist. Denying qualified blacks an apartment, failing to acknowledge innocence of accused when DNA evidence exonerated them, stating he did not want blacks in his accounting department (only men in yarmulkes)...I think he qualifies.",
        "label": "no"
    },
    {
        "text": "Democracy is worth a few bucks to me. If you want this to end, tell Harper to repeal the sections of Bill C-45 that apply to treaty rights and the environment. The manner in which C-45 was passed is an assault on our proud Parliamentary tradition.",
        "label": "no"
    },
    {
        "text": "Very good article, written in a refreshing style. 'food on the table conservative', 'obediently lie back and think of Canada' snerk. This is type of criticism that makes an impact, not the hysterical doom-mongering from Starbucks Slacktivists.",
        "label": "no"
    },
    {
        "text": "I don't know why you got thumbs down on this. I have read the Koran as well, and perhaps just perhaps if there hadn't been 'stuff' added on as became convenient, Islam might not be in quite such as mess as it is. And it is a mess, for sure.",
        "label": "no"
    },
    {
        "text": "Ahh Michele K, you are hitting on an important point. The reality is that this is *NOT* 'free trade' but rather 'managed trade'.Still, this level of 'managed trade' is less than what we had before, so it is an improvement and should be passed.",
        "label": "no"
    },
    {
        "text": "Of the 213 comments posted here, 210 criticize the bill and 3 support it. Please Mr. Polievre, tell us again what Canadians think of your fair elections act. PS if Nigel Wright were to show up to vote, would you vouch for him as being honourable?",
        "label": "no"
    },
    {
        "text": "Oo. Oo. Oo. A Muslim front organization. Will you people please put these childish conspiracy theories to rest? Or at least leave them in the bar where they belong. But hey! It's those Men in Black right? From that secret base under Area 51.",
        "label": "no"
    },
    {
        "text": "The middle class should be upset we making less and less money every year with increasing costs of living and stagnant wages. The federal and provincial government consistently make life better for the top 10% while the rest of us fall behind.",
        "label": "no"
    },
    {
        "text": "Smith is finished - as far as having a long term political career. Good for Alberta! The Alberta Party and the Liberal Party should be able to make a lot of progress in the next election. Hopefully, one of them forming the new government in Alberta.",
        "label": "no"
    },
    {
        "text": "All these problems would go away if only Canada would insist on single nationality. You want to be a Canadian - leave your Pakistani-ness, Americana, Britdom behind! Who says which nationality is OK to be a dual-national of and which one is not?",
        "label": "no"
    },
    {
        "text": "Great post jasperthe one item worthy of mention this day is Harper's move to buy the NRA in on Canada's Action Plan. Today huffpost reports on the thousands of deaths by gun in the USA SINCE NEWTON. Thank you Steve for inviting the NRA into Canada!",
        "label": "no"
    },
    {
        "text": "Great comment, the West's role in creating this horror story is ignored by Western governments and media alike. You wonder how serious Western leaders are in fighting terror when they keep creating the ideal situations for terrorists to thrive in.",
        "label": "no"
    },
    {
        "text": "@ce_nedra Everyone can plan to offset the financial costs you mentioned. That's no big deal. However, for a few women it's the cost of lost career opportunity, promotion, and salary increases which hurt the most. They will never recover from that.",
        "label": "no"
    },
    {
        "text": "...Chretien's big win was 167 Liberal seats to 2 PCs....but but... Could it be... Harper is going to best Mulroney's record... from a 151-seat majority to two seats in the worst defeat ever suffered for a governing party at the Federal level...",
        "label": "no"
    },
    {
        "text": "As usual, Quebec is at the forefront of social change later adopted in the rest of Canada: Public daycare? checkHuman euthanasia ? checkBanning the niqab? checkAs for the niqab, perhaps this is because only Quebec has a culture worth saving?",
        "label": "no"
    },
    {
        "text": "Well you are right there are 4% of us that are aboriginals as 0f 2011. 3.8 in 2006, 3.3 in 2001 and 2.8 in 1996......it's growing fast. So why not elect the to senate. It is after all their country.....their land, their water man I' like this idea.",
        "label": "no"
    },
    {
        "text": "\"delayed the next ice age by 30 to 50 thousand years.\" Hadn't realized these could be timed. Regardless. So delaying the next ice age is bad? 12,000 years ago much of Canada was under a sheet of ice. Not sure offhand how far south it went.",
        "label": "no"
    },
    {
        "text": "Its a fact that men pay the majority of child care expenses. in 2 income families men are most often the primary breadwinner. in single mother families the father pays child support. where did you get the idea that women pay the most financially?",
        "label": "no"
    },
    {
        "text": "All kinds of 'pundits' (i.e. media shills working for the Harper party) are saying Adams is 'toxic' for the Liberals because of all the trouble she gave the Cons. Um ... hello, giving trouble to the Cons is a desirable thing from the Liberal pov.",
        "label": "no"
    },
    {
        "text": "Apparently the GG was prepared to attend the meeting but Chief Spence upped her demands. She is now demanding that Justin Bieber and Wayne Gretzky attend. Rumours continue to swirl in Ottawa that she may also be demanding that Elvis attend.",
        "label": "no"
    },
    {
        "text": "Il faut lire ? ou relire! ? 'Le Camp des Saints,'* de Jean Raspail (1973).??????* a reasonable, if somewhat pedestrian, translation by Norman Shapiro, 'The Camp of the Saints,' used to be, may still be, available for downloading, archive. org.",
        "label": "no"
    },
    {
        "text": "One of the most coherent and sensible articles I've read on this matter. If a cancer patient wearing a head scarf was in her court room, would she throw that person out as well? This judge should indeed be sanctioned and sent back to law school.",
        "label": "no"
    },
    {
        "text": "Harper only said 'it speaks for itself'. How is that a criticism. I think he's leaving it to the public to decide how they feel about a P.M. who admits to breaking the law, then voting in favor of legalizing it; not very responsible if you ask me.",
        "label": "no"
    },
    {
        "text": "'We all say we hate them, but they work and we pay attention to them. Trudeau is far better than harper. He actually talks to people....real people'You make it sound like Trudeau has a hidden agenda there, or am I confusing my attack ads again?",
        "label": "no"
    },
    {
        "text": "I don't think we have to look back that far, TMP, but the grandkids are going to appreciate the meaning of good planning as they are required to re-discover the paleolithic with its concern for communitarian ideals. More natural foods as well. :)",
        "label": "no"
    },
    {
        "text": "It would appear that women are not prone to obsession and all it's ugly manifestations. Now that women are outnumbering men in our institutes of higher education matbe they'll take over the field of psychiatry and get these issues resolved.",
        "label": "no"
    },
    {
        "text": "The boat people arrived into a pre-harper Canada, that hadn't been ravaged by neoconservatism, that didn't blame the poor for being poor, and didn't think an appropriate level of taxation was some kind of heinous assault on those with resources.",
        "label": "no"
    },
    {
        "text": "I'm not voting for him (who knows . . . the Liberals may change my mind over the next while . . ), but he presents to me what seems a more honest figure than Stephen Harper. That alone in this day and age will garner him significant votes.",
        "label": "no"
    },
    {
        "text": "Well, in BC at least, international law says most of BC is owned by the first nations, and they have gotten very little from successive Canadian governments. Any money owing to our first nations, both in BC and across Canada, is more than deserved.",
        "label": "no"
    },
    {
        "text": "Do they help Canadians? Yes!Have been doing so long before the recent influx of Syrians ... the article here mentions some of them ... e.g. people who have become homeless, trying to rebuild and can't afford new, not even Ikea-type to re-furnish.",
        "label": "no"
    },
    {
        "text": "While Richard is wrong in stating that Ab is not a large emitter. We have huge industrial emissions. His point is that the source emissions will be generated wherever the oil is produced and so in the end despite being wrong his point still stands.",
        "label": "no"
    },
    {
        "text": "Dude, a) Some of us on the right despise Harperb) Not everybody breaks Godwin's Lawc) articles on here are not written just so we can commentd) If you think its only the left that hates in this country you have not been looking in the mirror",
        "label": "no"
    },
    {
        "text": "@margaretlp That's 3 X 24 hour days per MONTH. Not too shabby & how does one perform at a top level for a 24 hour period? I usually fade at the 16-17 hour mark!!! The waterfront property is interesting. Muskogee, I presume?? I'll toast to that.",
        "label": "no"
    },
    {
        "text": "So, if we stand too far away, we're expressing fear and loathing of you. If we stand too close, we're intimidating and jostling you. Let us know how we should behave, be precise, and we'll do our very best to accommodate you. Maybe make it a law.",
        "label": "no"
    },
    {
        "text": "Generally agree with Saunders. As the MSM declines and social media/blogging expands to fill the vacuum this tendency will only increase. Good information on any topic is out there but one has to be discerning and honest about your prejudices.",
        "label": "no"
    },
    {
        "text": "Read history. The same segment of the population voted for the Nazi party in 1933 and they also called Hitler a clown. But I do not belief it can happen in America. The anti-Trump camp is strong and solid. He probably will not be the next president.",
        "label": "no"
    },
    {
        "text": "So you're all in favour of paying more taxes to keep petty thieves in jail longer. Maybe, the rest of us aren't. Mandatory minimums for certain crimes make sense. It doesn't make sense to keep some kid in jail for years because he stole a pizza!",
        "label": "no"
    },
    {
        "text": "Thanks Doug for reporting the truth of the matter, as it helps GM readers to catch up on reality. Our added CO2 is net beneficial. Cold kills, warming is good, just ask the Romans who uses to grow grapes at Hadrians wall. You can't do that now.",
        "label": "no"
    },
    {
        "text": "The journey of a thousand miles begins with ONE step. Lao Tzu If you think you are too SMALL to make a difference, try sleeping with a mosquito.? Dalai Lama XIVSuccess is the sum of SMALL efforts, repeated day in and day out. - Robert Collier",
        "label": "no"
    },
    {
        "text": "It's 'revenue neutral'. What you pay in higher taxes for things that require a lot of CO2 emissions, you'll save elsewhere in lower taxes on something that doesn't. B.C. did the same thing, their economy is doing fine, and their emissions are down.",
        "label": "no"
    },
    {
        "text": "Quebec language laws are perceived by the Supreme court of Canada, the British monarchy and the rest of the world as fair, necessary and respectfull of everybody. An inspiration for those countries who wish to preserve their identity. Bravo Qu?bec!",
        "label": "no"
    },
    {
        "text": "dave - I don't recall him saying he doesn't 'currently' use crack. I believe the quote is 'I don't use crack'While I believe that he did smoke crack in the video and that it was his intention to mislead, I don't believe it is fair to misquote him.",
        "label": "no"
    },
    {
        "text": "It was Trumplethinskin that used 'oral sewage and fear Mongering' - the very 'oral sewage and fear Mongering' that has most Americans (and a vast chunk of the rest of the world) panicking. Your projection is almost as 'good' as The Orange One's.",
        "label": "no"
    },
    {
        "text": "Thank you from the depths of my heart, Mr. Peterson. This is a huge gift to all Canadians in a time when we so desperately need good news with regard to the environment and our scientists. I hope that your efforts inspire others to follow suit.",
        "label": "no"
    },
    {
        "text": "How come +2-7 = 0? For a comment total in a post which favours the Globe in this debate. Or +34-12 = 12, in a post which is critical of the Globe's official line. The darkest pages of the history book of the moral devolution of free Canadian press.",
        "label": "no"
    },
    {
        "text": "I think you are going to see the nation state reborn in the next couple of years. Globalization is not working. The world is in stasis with no growth. Part of the problem is the universality of policy and the agreement not to upset the apple cart.",
        "label": "no"
    },
    {
        "text": "Just where in the Globe have you witnessed \"much about this\" racism ? Particularly the GOP's increasing use of the president's colour to win friends and influence people, Rt ? Where's the Washington correspondent of past years ? Back home, right ?",
        "label": "no"
    },
    {
        "text": "Over the last 100 years a series of small changes have cumulatively have a drastic impact on automobiles. There's nothing to say that greener energy won't become economically viable on a slow, gradual schedule rather than in one huge step.",
        "label": "no"
    },
    {
        "text": "smoker bans were the trial balloon for more attacks against personal and parental autonomy. Sugar, salt, booze and etc have now been 'deemed' 'the new tobacco' using the exact same tactics to 'denormalize' (segregation and hatred) consumers.",
        "label": "no"
    }
]